title: AWS Extraction of Private Oor Public Keys
id: 25543730-e8e5-4bfa-add6-df9e29b94e65
description: This filter detects AWS extraction of private or public keys.
author: Trend Micro
date: 2022/09/26
tags:
    - attack.t1552
logsource:
    product: aws
    category: CLOUD_ACTIVITY
detection:
    operation:
        eventName: 'GetParameter'
    condition: operation
level: medium
taxonomy: tm-v1
