title: CrowdStrike Pattern Disposition - Terminate Process, Terminate Action Failed
description: CrowdStrike Response for Detection by Terminate Process, Terminate Action Failed
tags: []
logsource:
    category: THIRD_PARTY_LOG
    product: CrowdStrike
    definition: THIRDPARTY_THIRDPARTY
detection:
    string_condition_0:
        act: '*Kill Process * Kill Action Failed*'
    condition: string_condition_0
level: info
taxonomy: tm-v1