title: CrowdStrike Pattern Disposition - Handle Operation Downgraded, Critical Process Disabled
description: CrowdStrike Response for Detection by Downgrading Handle Operation, Disabling Critical Process 
tags: []
logsource:
    category: THIRD_PARTY_LOG
    product: CrowdStrike
    definition: THIRDPARTY_THIRDPARTY
detection:
    string_condition_0:
        act: '*Handle Operation Downgraded * Critical Process Disabled*'
    condition: string_condition_0
level: info
taxonomy: tm-v1