title: CrowdStrike Pattern Disposition - Response Action Failed, Process Blocked 
description: CrowdStrike detection for Response Action Failed and Process Blocked 
tags: []
logsource:
    category: THIRD_PARTY_LOG
    product: CrowdStrike
    definition: THIRDPARTY_THIRDPARTY
detection:
    string_condition_0:
        act: '*Block Process * Response Action Failed*'
    condition: string_condition_0
level: info
taxonomy: tm-v1
