title: CrowdStrike Pattern Disposition - Process Terminate,Operation Blocked
description: CrowdStrike alert for Process Terminate,Operation Blocked. 
tags: []
logsource:
    category: THIRD_PARTY_LOG
    product: CrowdStrike
    definition: THIRDPARTY_THIRDPARTY
detection:
    string_condition_0:
        act: '*Kill Process * Operation Blocked*'
    condition: string_condition_0
level: info
taxonomy: tm-v1
