title: CrowdStrike Pattern Disposition - Quarantine File, File System Operation Blocked
description: CrowdStrike Response for Detection by Blocking File System Operation and Quarantine File
tags: []
logsource:
    category: THIRD_PARTY_LOG
    product: CrowdStrike
    definition: THIRDPARTY_THIRDPARTY
detection:
    string_condition_0:
        act: '*Quarantine File * File system Operation Blocked*'
    condition: string_condition_0
level: info
taxonomy: tm-v1