title: CrowdStrike Pattern Disposition - Policy Disabled, File System Operation Blocked
description: CrowdStrike Response for Detection by Disabling Policy and Blocking File System Operation
tags: []
logsource:
    category: THIRD_PARTY_LOG
    product: CrowdStrike
    definition: THIRDPARTY_THIRDPARTY
detection:
    string_condition_0:
        act: '*Policy Disabled * File system Operation Blocked*'
    condition: string_condition_0
level: info
taxonomy: tm-v1