title: CrowdStrike Pattern Disposition - File System Operation Blocked and Policy Disabled
description: CrowdStrike Response for Detection by Terminating Parent Process
tags: []
logsource:
    category: THIRD_PARTY_LOG
    product: CrowdStrike
    definition: THIRDPARTY_THIRDPARTY
detection:
    string_condition_0:
        act: 'File system Operation Blocked'
    condition: string_condition_0
level: info
taxonomy: tm-v1