title: CrowdStrike Pattern Disposition - Process Terminate, Critical Process Disabled
description: CrowdStrike Response for Detection by Terminating Process and Disabling Critical Process
tags: []
logsource:
    category: THIRD_PARTY_LOG
    product: CrowdStrike
    definition: THIRDPARTY_THIRDPARTY
detection:
    string_condition_0:
        act: '*Kill Process * Critical Process Disabled*'
    condition: string_condition_0
level: info
taxonomy: tm-v1