title: CrowdStrike Pattern Disposition - Handle Operation Downgraded
description: CrowdStrike Response for Detection by Downgrading Handle Operation
tags: []
logsource:
    category: THIRD_PARTY_LOG
    product: CrowdStrike
    definition: THIRDPARTY_THIRDPARTY
detection:
    string_condition_0:
        act: 'Handle Operation Downgraded'
    condition: string_condition_0
level: info
taxonomy: tm-v1