title: CrowdStrike Pattern Disposition - Parent Process Terminate
description: CrowdStrike Response for Detection by Terminating Parent Process
tags: []
logsource:
    category: THIRD_PARTY_LOG
    product: CrowdStrike
    definition: THIRDPARTY_THIRDPARTY
detection:
    string_condition_0:
        act: 'Detection * parent process would have been killed if related prevention policy setting was enabled*'
    condition: string_condition_0
level: info
taxonomy: tm-v1