title: Listing of Vssadmin Shadows
description: Detects the use of the 'vssadmin list shadows' command, which is often used by attackers to identify and potentially delete Volume Shadow Copies to hinder recovery efforts and found in CrowdStrike telemetry.
tags: []
logsource:
    category: THIRD_PARTY_LOG
    product: CrowdStrike
    definition: THIRDPARTY_THIRDPARTY
detection:
    string_condition_0:
        processCmd: '*vssadmin*' 
        processCmd: '*list*'
        processCmd: '*shadows*'
    condition: string_condition_0 
level: info
taxonomy: tm-v1
