title: CrowdStrike Pattern Disposition - Detection, File Quarantined
description: CrowdStrike detection for Detection and File Quarantined
tags: []
logsource:
    category: THIRD_PARTY_LOG
    product: CrowdStrike
    definition: THIRDPARTY_THIRDPARTY
detection:
    string_condition_0:
        act: 'Detection * Quarantine File*'
    condition: string_condition_0
level: info
taxonomy: tm-v1
