title: Net User Delete  
description: CrowdStrike Falcon detecting a possible deletion of a user account using the Windows net user command.
tags: []
logsource:
    category: THIRD_PARTY_LOG
    product: CrowdStrike
    definition: THIRDPARTY_THIRDPARTY
detection:
    string_condition_0:
        processCmd|re: 'net.+user(?:(?!.+\/delete)(?:.|\\n))*.+\/delete'
    condition: string_condition_0
level: info
taxonomy: tm-v1