title: Possible Persistence via Outlook Macro File
description: Detects the use of Outlook macro files that may indicate persistence activity in CrowdStrike Telemetry
tags: []
logsource:
    category: THIRD_PARTY_LOG
    product: CrowdStrike
    definition: THIRDPARTY_THIRDPARTY
detection:
    string_condition_0:
        objectFilePath: '*\\Roaming\\Microsoft\\Outlook*'
        objectFilePath: '*.otm'
    condition: string_condition_0 
level: info
taxonomy: tm-v1