title: Possible Gathering of System Info and Network Data
description: CrowdStrike Falcon detects execution of common commands used to gather system information and network data, which may indicate reconnaissance activities.
tags: []
logsource:
    category: THIRD_PARTY_LOG
    product: CrowdStrike
    definition: THIRDPARTY_THIRDPARTY
detection:
    string_condition_0:
        processCmd:
            - '*systeminfo*'
            - '*ver >*'
            - '*type*%APPDATA%*'
            - '*ipconfig*'
            - '*“net*view”*'
            - '*arp -a*'
            - '*netstat*'
    condition: string_condition_0
level: info
taxonomy: tm-v1