title: Possible Pass the Hash and Pass the Ticket Arguments Found in CrowdStrike Telemetry 
description: Detects the use of Mimikatz Arguments that may indicate Pass the Hash or Pass the Ticket activity in CrowdStrike Telemetry
tags: []
logsource:
    category: THIRD_PARTY_LOG
    product: CrowdStrike
    definition: THIRDPARTY_THIRDPARTY
detection:
    string_condition_0:
        processCmd: 
            - '*sekurlsa::pth*'
            - '*\/ntlm:*'
            - '*kerberos::ptt*'
    condition: string_condition_0
level: info
taxonomy: tm-v1