title: Registry Credential Enumeration
description: Detects the querying of registry keys that may contain stored credentials in CrowdStrike Telemetry.
tags: []
logsource:
    category: THIRD_PARTY_LOG
    product: CrowdStrike
    definition: THIRDPARTY_THIRDPARTY
detection:
    string_condition_0:
        objectCmd: '*query HKLM \/f password \/t REG_SZ \/s*'
    string_condition_1:
        objectCmd: '*query HKCU \/f password \/t REG_SZ \/s*'
    string_condition_2:
        objectCmd: '*query HKCU\\Software\\SimonTatham\\PuTTY\\Sessions \/t REG_SZ \/s*'
    condition: string_condition_0 or string_condition_1 or string_condition_2
level: info
taxonomy: tm-v1