title: Scheduled Task Created via AT Command
description: CrowdStrike Falcon detection for scheduled tasks created via the at.exe command with the /interactive flag.
tags: []
logsource:
    category: THIRD_PARTY_LOG
    product: CrowdStrike
    definition: THIRDPARTY_THIRDPARTY
detection:
    string_condition_0:
        processFileName: 'at.exe'
        processCmd: '*/interactive *'
    condition: string_condition_0 
level: info
taxonomy: tm-v1