title: Scripted Lateral RDP
description: Detects the use of cmdkey.exe to create RDP credentials for lateral movement in CrowdStrike Telemetry 
tags: []
logsource:
    category: THIRD_PARTY_LOG
    product: CrowdStrike
    definition: THIRDPARTY_THIRDPARTY
detection:
    string_condition_0:
        objectFileName: 'cmdkey.exe'
        objectCmd: '*generic:TERMSRV*'
        objectCmd: '*user:*'
        objectCmd: '*pass:*'
    condition: string_condition_0
level: info
taxonomy: tm-v1