title: Service Start
description: CrowdStrike Falcon detects when a service is created and started
  using the 'sc.exe create' command followed by the 'Start-Service' PowerShell
  command.
tags: []
logsource:
    category: THIRD_PARTY_LOG
    product: CrowdStrike
    definition: THIRDPARTY_THIRDPARTY
detection:
    string_condition_0:
        processName: 
            - 'sc.exe'
        processCmd:
            - '*create*'
    string_condition_1:
        processCmd:
            - '*Start-Service*'
    condition: string_condition_0 or string_condition_1
level: info
taxonomy: tm-v1