title: Service Creation
description: CrowdStrike Falcon detects the creation of Windows services via command line.
tags: []
logsource:
    category: THIRD_PARTY_LOG
    product: CrowdStrike
    definition: THIRDPARTY_THIRDPARTY
detection:
    string_condition_0:
        processName: 
            - 'sc.exe'
        processCmd:
            - '*binPath=*'
    condition: string_condition_0
level: info
taxonomy: tm-v1