title: Windows Logon Scripts
description: CrowdStrike Falcon detects the creation of Windows logon scripts via command line, which may indicate persistence mechanisms being established.
tags: []
logsource:
    category: THIRD_PARTY_LOG
    product: CrowdStrike
    definition: THIRDPARTY_THIRDPARTY
detection:
    string_condition_0:
        processCmd:
            - '*UserInitMprLogonScript*'
    condition: string_condition_0
level: info
taxonomy: tm-v1