title: Windows Share Creation
description: CrowdStrike Falcon detects the creation of Windows shares via command line or PowerShell.
tags: []
logsource:
    category: THIRD_PARTY_LOG
    product: CrowdStrike
    definition: THIRDPARTY_THIRDPARTY
detection:
    string_condition_0:
        processCmd: 
            - '*New-PSDrive*'
    string_condition_1:
        processName: 
            - 'net.exe'
        processCmd:
            - '*use *'
    condition: string_condition_0 or string_condition_1
level: info
taxonomy: tm-v1