title: Windows Management Instrumentation Event Subscription
description: CrowdStrike Falcon detects the creation of Windows Management Instrumentation (WMI) event subscriptions via PowerShell, which may indicate persistence mechanisms being established.
tags: []
logsource:
    category: THIRD_PARTY_LOG
    product: CrowdStrike
    definition: THIRDPARTY_THIRDPARTY
detection:
    string_condition_0:
        processCmd: 
            - '*New-CimInstance -Namespace root/subscription*'
    condition: string_condition_0
level: info
taxonomy: tm-v1