title: Athens to UE Servers Allow Traffic Filter
description: Monitors allowed network traffic from Athens location to User Equipment servers. This filter tracks legitimate communications between Athens infrastructure and UE server resources to establish baseline network patterns and identify potential policy violations or unauthorized access attempts that may bypass expected traffic flows.
tags: []
logsource:
  definition: THIRDPARTY_THIRDPARTY
  category: THIRD_PARTY_LOG
  product: WatchGuard
detection:
  mappingtable:
    policyName:
    - Athens to UE Servers Any-00
    act:
    - '["Allow"]'
  condition: mappingtable
level: info
taxonomy: tm-v1
