title: External Access to DesktopCentral Management Port
description: Detects allowed external connections to DesktopCentral service on port 8383. This activity indicates remote access to desktop management infrastructure which should be monitored for unauthorized administrative access attempts and potential security policy violations.
tags: []
logsource:
  definition: THIRDPARTY_THIRDPARTY
  category: THIRD_PARTY_LOG
  product: WatchGuard
detection:
  mappingtable:
    policyName:
    - External to DesktopCentral 8383-00
    act:
    - '["Allow"]'
  condition: mappingtable
level: info
taxonomy: tm-v1
