title: US Users Internal Network Access Monitoring
description: Monitors allowed traffic from US-based users accessing internal network resources. This filter tracks legitimate internal communications to establish baseline patterns and identify potential anomalies in user access behavior that could indicate compromised accounts or unauthorized access attempts.
tags: []
logsource:
  definition: THIRDPARTY_THIRDPARTY
  category: THIRD_PARTY_LOG
  product: WatchGuard
detection:
  mappingtable:
    policyName:
    - US Users to Internal Any-00
    act:
    - '["Allow"]'
  condition: mappingtable
level: info
taxonomy: tm-v1
