title: WiFi User External Access Allowed
description: Detects when WiFi users are granted access to external networks or internet resources. This filter monitors outbound traffic from wireless devices to identify potential data exfiltration, unauthorized external communications, or policy violations. Important for tracking wireless network usage patterns and ensuring WiFi users comply with acceptable use policies.
tags: []
logsource:
  definition: THIRDPARTY_THIRDPARTY
  category: THIRD_PARTY_LOG
  product: WatchGuard
detection:
  mappingtable:
    policyName:
    - WiFi Users to External Any-00
    act:
    - '["Allow"]'
  condition: mappingtable
level: info
taxonomy: tm-v1
