title: User Management - Password Expiration Warning
description: Dell detection for  the user password is about to expire.
references:
    - https://dl.dell.com/content/manual23434279-dell-smartfabric-os10-system-log-message-reference.pdf?language=en-us
tags: []
logsource:
    category: THIRD_PARTY_LOG
    product: Dell
    definition: THIRDPARTY_THIRDPARTY
detection:
    string_condition_0:
        eventName: '*WARN_CHANGE*'
    condition: string_condition_0
level: info
taxonomy: tm-v1
