title: Possible Credential Scanning in Active Directory
id: 1934e992-dfd6-53c1-aa93-8cacb6cf74a0
description: The workstation has experienced multiple instances of NTLM validation failure records across multiple users within the past 24 hours, which indicates possible credential scanning in Active Directory.
author: Trend Micro
date: 2023/06/16
tags:
    - attack.t1110.003
logsource:
    category: DETECTION
    definition: ACCOUNT_DETECTION
detection:
    rule:
        ruleName: SC-019
    condition: rule
level: low
taxonomy: tm-v1
