title: Apache HTTP Server Directory Traversal
description: Check Point Security detection for Apache HTTP Server Directory Traversal
tags:
- mitre.t1190
logsource:
  definition: THIRDPARTY_THIRDPARTY
  category: THIRD_PARTY_LOG
  product: Check Point
detection:
  mappingtable:
    ruleName:
    - Apache HTTP Server Directory Traversal
    category: IPS
  condition: mappingtable
level: info
taxonomy: tm-v1
