title: Chasys Draw IES BMP Buffer Overflow
description: Check Point Security detection for Chasys Draw IES BMP Buffer Overflow
tags:
- mitre.t1190
logsource:
  definition: THIRDPARTY_THIRDPARTY
  category: THIRD_PARTY_LOG
  product: Check Point
detection:
  mappingtable:
    ruleName:
    - Chasys Draw IES BMP Buffer Overflow
    category: IPS
  condition: mappingtable
level: info
taxonomy: tm-v1
