title: D-Link Multiple Products Remote Code Execution
description: Check Point Security detection for D-Link Multiple Products Remote Code Execution
tags:
- mitre.t1190
logsource:
  definition: THIRDPARTY_THIRDPARTY
  category: THIRD_PARTY_LOG
  product: Check Point
detection:
  mappingtable:
    ruleName:
    - D-Link Multiple Products Remote Code Execution
    category: IPS
  condition: mappingtable
level: info
taxonomy: tm-v1
