title: Masscan Port Scanner
description: Check Point Security detection for Masscan Port Scanner
tags:
- mitre.t1190
logsource:
  definition: THIRDPARTY_THIRDPARTY
  category: THIRD_PARTY_LOG
  product: Check Point
detection:
  mappingtable:
    ruleName:
    - Masscan Port Scanner
    category: IPS
  condition: mappingtable
level: info
taxonomy: tm-v1
