title: Microsoft SMB Crafted Write Request Denial of Service (MS11-048)
description: Check Point Security detection for Microsoft SMB Crafted Write Request Denial of Service (MS11-048)
tags:
- mitre.t1190
logsource:
  definition: THIRDPARTY_THIRDPARTY
  category: THIRD_PARTY_LOG
  product: Check Point
detection:
  mappingtable:
    ruleName:
    - Microsoft SMB Crafted Write Request Denial of Service (MS11-048)
    category: IPS
  condition: mappingtable
level: info
taxonomy: tm-v1
