title: Null HTTP Encodings
description: Check Point Security detection for Null HTTP Encodings
tags:
- mitre.t1190
logsource:
  definition: THIRDPARTY_THIRDPARTY
  category: THIRD_PARTY_LOG
  product: Check Point
detection:
  mappingtable:
    ruleName:
    - Null HTTP Encodings
    category: IPS
  condition: mappingtable
level: info
taxonomy: tm-v1
