title: PHP Easter Egg Information Disclosure
description: Check Point Security detection for PHP Easter Egg Information Disclosure
tags:
- mitre.t1190
logsource:
  definition: THIRDPARTY_THIRDPARTY
  category: THIRD_PARTY_LOG
  product: Check Point
detection:
  mappingtable:
    ruleName:
    - PHP Easter Egg Information Disclosure
    category: IPS
  condition: mappingtable
level: info
taxonomy: tm-v1
