title: Resource Records Enforcement
description: Check Point Security detection for Resource Records Enforcement
tags:
- mitre.t1190
logsource:
  definition: THIRDPARTY_THIRDPARTY
  category: THIRD_PARTY_LOG
  product: Check Point
detection:
  mappingtable:
    ruleName:
    - Resource Records Enforcement
    category: IPS
  condition: mappingtable
level: info
taxonomy: tm-v1
