title: Telesquare Multiple Products Command Injection
description: Check Point Security detection for Telesquare Multiple Products Command Injection
tags:
- mitre.t1190
logsource:
  definition: THIRDPARTY_THIRDPARTY
  category: THIRD_PARTY_LOG
  product: Check Point
detection:
  mappingtable:
    ruleName:
    - Telesquare Multiple Products Command Injection
    category: IPS
  condition: mappingtable
level: info
taxonomy: tm-v1
