title: Tenda O3 Command Injection
description: Check Point Security detection for Tenda O3 Command Injection
tags:
- mitre.t1190
logsource:
  definition: THIRDPARTY_THIRDPARTY
  category: THIRD_PARTY_LOG
  product: Check Point
detection:
  mappingtable:
    ruleName:
    - Tenda O3 Command Injection
    category: IPS
  condition: mappingtable
level: info
taxonomy: tm-v1
