title: Web Server Exposed Git Repository Information Disclosure
description: Check Point Security detection for Web Server Exposed Git Repository Information Disclosure
tags:
- mitre.t1190
logsource:
  definition: THIRDPARTY_THIRDPARTY
  category: THIRD_PARTY_LOG
  product: Check Point
detection:
  mappingtable:
    ruleName:
    - Web Server Exposed Git Repository Information Disclosure
    category: IPS
  condition: mappingtable
level: info
taxonomy: tm-v1
