title: Web Servers Malicious HTTP Header Directory Traversal
description: Check Point Security detection for Web Servers Malicious HTTP Header Directory Traversal
tags:
- mitre.t1190
logsource:
  definition: THIRDPARTY_THIRDPARTY
  category: THIRD_PARTY_LOG
  product: Check Point
detection:
  mappingtable:
    ruleName:
    - Web Servers Malicious HTTP Header Directory Traversal
    category: IPS
  condition: mappingtable
level: info
taxonomy: tm-v1
