title: WordPress Slider Revolution Plugin Local File Inclusion
description: Check Point Security detection for WordPress Slider Revolution Plugin Local File Inclusion
tags:
- mitre.t1190
logsource:
  definition: THIRDPARTY_THIRDPARTY
  category: THIRD_PARTY_LOG
  product: Check Point
detection:
  mappingtable:
    ruleName:
    - WordPress Slider Revolution Plugin Local File Inclusion
    category: IPS
  condition: mappingtable
level: info
taxonomy: tm-v1
