title: Downloading of Python Script from Remote URL via Python
description: Detected a cron job that downloads a Python script from a remote URL using python and executes it. This technique is often used by attackers to run malicious code on a compromised system.
tags: []
logsource:
    category: THIRD_PARTY_LOG
    product: VMware
    definition: THIRDPARTY_THIRDPARTY
detection:
    parser:
        actualParserId: vrl.syslog.vmware.esxi.crond
    string_condition_0:
        objectCmd: '*\/usr\/bin\/python*'
        objectCmd: '*-c import urllib2*'
        objectCmd: '*http:\/\/*.py*'
        objectCmd: '*exec*'
    condition: parser and string_condition_0
level: info
taxonomy: tm-v1
