title: IDS Signature Matched (Blocked)
description: Cisco Meraki detection for IDS signature matched (blocked). Detects events from Meraki MX where an IDS/IPS signature is present and the traffic was blocked.
tags:
    - mitre.t1190
logsource:
    category: THIRD_PARTY_LOG
    product: Meraki
    definition: THIRDPARTY_THIRDPARTY
detection:
    string_condition_0:
        vendorParsed.decision: '*blocked*'
    string_condition_1:
        vendorParsed.signature|exists: true
    condition: string_condition_0 and string_condition_1
level: info
taxonomy: tm-v1
