title: IDS Signature Matched (Ingress)
description: Cisco Meraki detection for IDS signature matched (ingress). Detects IDS/IPS signature matches on ingress traffic on Meraki MX.
tags:
    - mitre.t1190
logsource:
    category: THIRD_PARTY_LOG
    product: Cisco
    definition: THIRDPARTY_THIRDPARTY
detection:
    string_condition_0:
        vendorParsed.direction: '*ingress*'
    string_condition_1:
        vendorParsed.signature|exists: true
    productName:
        pname: 'Meraki'
    condition: productName and string_condition_0 and string_condition_1
level: info
taxonomy: tm-v1
