title: ISAKMP-SA Established (Pre MX 15.12)
description: Cisco Meraki detection for ISAKMP-SA established (pre MX 15.12). Detects legacy IKEv1 Phase 1 (ISAKMP-SA) establishment events on Meraki MX firmware prior to 15.12.
tags:
    - mitre.t1572
logsource:
    category: THIRD_PARTY_LOG
    product: Cisco
    definition: THIRDPARTY_THIRDPARTY
detection:
    string_condition_0:
        vendorParsed.msg: '*ISAKMP-SA*'
    string_condition_1:
        vendorParsed.msg: '*established*'
    productName:
        pname: 'Meraki'
    condition: productName and string_condition_0 and string_condition_1
level: info
taxonomy: tm-v1
