title: Rogue SSID Detected
description: Cisco Meraki detection for Rogue SSID detected. Detects Meraki wireless events indicating an unauthorized/rogue SSID has been detected.
tags:
    - mitre.t1557
logsource:
    category: THIRD_PARTY_LOG
    product: Cisco
    definition: THIRDPARTY_THIRDPARTY
detection:
    string_condition_0:
        vendorParsed.type: '*rogue_ssid_detected*'
    productName:
        pname: 'Meraki'
    condition: productName and string_condition_0
level: info
taxonomy: tm-v1
