title: SSID Spoofing Detected
description: Cisco Meraki detection for SSID spoofing detected. Detects Meraki wireless events where a device is broadcasting an organization SSID name without authorization.
tags:
    - mitre.t1557
logsource:
    category: THIRD_PARTY_LOG
    product: Cisco
    definition: THIRDPARTY_THIRDPARTY
detection:
    string_condition_0:
        vendorParsed.type: '*ssid_spoofing_detected*'
    productName:
        pname: 'Meraki'
    condition: productName and string_condition_0
level: info
taxonomy: tm-v1
