title: Identified Suspicious Access Token Manipulation
id: cd1f3b0f-3425-4f29-b56a-007c757f39eb
description: Adversaries may modify access tokens to operate under a different user or system security context to perform actions and bypass access controls.
references:
    - https://attack.mitre.org/techniques/T1134/001
author: Trend Micro
date: 2021/10/26
tags:
    - attack.t1134.001
logsource:
    category: DETECTION
    definition: LOG_INSPECTION_EVENT
detection:
    s1:
        ruleId: '1008670'
        subRuleId:
            - '904084' 
            - '19893'
    s2:
        remarks:
            - '*\windows\system32*' 
            - '*\windows\syswow64*'
            - '*\windows\winsxs*'
            - '*\ManageEngine\Exchange Reporter Plus\\*' 
    condition: s1 and not s2
level: medium
taxonomy: tm-v1
