title: File Transfer TCP Connection Blocked
description: Sophos Firewall detection for denied file transfer TCP connection indicating potential data exfiltration attempts
tags:
  - mitre.t1567
logsource:
  category: THIRD_PARTY_LOG
  product: Sophos
  definition: THIRDPARTY_THIRDPARTY
detection:
  application:
    application: 'File Transfer'
  protocol:
    proto: 'TCP'
  status:
    act: '*Denied*'
  condition: application and protocol and status
level: info
taxonomy: tm-v1
