title: Instant Messenger TCP Connection Dropped
description: Sophos Firewall detection for dropped instant messenger TCP connection indicating potential policy violation or security concern
tags:
  - mitre.t1071
logsource:
  category: THIRD_PARTY_LOG
  product: Sophos
  definition: THIRDPARTY_THIRDPARTY
detection:
  application:
    application: 'Instant Messenger'
  protocol:
    proto: 'TCP'
  status:
    act: '*Drop*'
  condition: application and protocol and status
level: info
taxonomy: tm-v1
