title: VoIP UDP Connection Blocked
description: Sophos Firewall detection for denied VoIP UDP connection indicating potential unauthorized voice communication attempts
tags:
  - mitre.t1071
logsource:
  category: THIRD_PARTY_LOG
  product: Sophos
  definition: THIRDPARTY_THIRDPARTY
detection:
  application:
    application: 'VoIP'
  protocol:
    proto: 'UDP'
  status:
    act: '*Denied*'
  condition: application and protocol and status
level: info
taxonomy: tm-v1
