title: Account - Master Password Changed
description: Detects when Keeper Security Account master password is changed.
references: 
    - https://docs.keeper.io/en/enterprise-guide/event-reporting/event-descriptions
tags: []
logsource:
    category: THIRD_PARTY_LOG
    product: keeper-security
    definition: THIRDPARTY_THIRDPARTY
detection:
    cat: 
        category: '*account*'
    string_condition_0:
        eventName: '*change_master_password*'
    condition: cat and string_condition_0
level: info
taxonomy: tm-v1
