title: BreachWatch - Detected High-Risk Record Password
description: Detects when Keeper Security's BreachWatch service identifies a high-risk password record.
references: 
    - https://docs.keeper.io/en/enterprise-guide/event-reporting/event-descriptions
tags: []
logsource:
    category: THIRD_PARTY_LOG
    product: keeper-security
    definition: THIRDPARTY_THIRDPARTY
detection:
    cat: 
        category: '*breachwatch*'
    string_condition_0:
        eventName: '*bw_record_high_risk*'
    condition: cat and string_condition_0
level: info
taxonomy: tm-v1