title: General Usage - User Deleted a Record
description: Detects when Keeper Security users delete a record from their vault.
references: 
    - https://docs.keeper.io/en/enterprise-guide/event-reporting/event-descriptions
tags: []
logsource:
    category: THIRD_PARTY_LOG
    product: keeper-security
    definition: THIRDPARTY_THIRDPARTY
detection:
    cat: 
        category: '*usage*'
    string_condition_0:
        eventName: '*record_delete*'
    condition: cat and string_condition_0
level: info
taxonomy: tm-v1