title: General Usage - Audit Sync Failed
description: Detects when Keeper Security Audit Sync fails.
references: 
    - https://docs.keeper.io/en/enterprise-guide/event-reporting/event-descriptions
tags: []
logsource:
    category: THIRD_PARTY_LOG
    product: keeper-security
    definition: THIRDPARTY_THIRDPARTY
detection:
    cat: 
        category: '*usage*'
    string_condition_0:
        eventName: '*audit_sync_failed*'
    condition: cat and string_condition_0
level: info
taxonomy: tm-v1