title: Policy - Admin Permission Added
description: Detects when Keeper Security Admin permissions are added via Policy.
references: 
    - https://docs.keeper.io/en/enterprise-guide/event-reporting/event-descriptions
tags: []
logsource:
    category: THIRD_PARTY_LOG
    product: keeper-security
    definition: THIRDPARTY_THIRDPARTY
detection:
    cat: 
        category: '*policy*'
    string_condition_0:
        eventName: '*admin_permission_added*'
    condition: cat and string_condition_0
level: info
taxonomy: tm-v1