title: Device Stopped Sending Events - Log Source Communication Failure
description: |-
  Detects when a QRadar SIEM generates an event indicating that a monitored log source or device has stopped sending events. This detection identifies the dispatched event '[TRT-04] - Device Stopped Sending Events' which is generated by QRadar's internal event absence detection mechanism when no events have been received from a monitored device group for more than one hour (3600 seconds).
references: []
tags: []
logsource:
  category: THIRD_PARTY_LOG
  product: Ibm
  definition: THIRDPARTY_THIRDPARTY
detection:
  selection:
    eventName: '*Device Stopped Sending Events*'
    vendor: 'IBM'
  selection_description:
    description: '*has not sent logs for more than*'
  condition: selection and selection_description
level: info
taxonomy: tm-v1
