title: Active Directory (AD) Reconnaissance Activities
description: MDE Detection for AD reconnaissance activities
tags: []
logsource:
    category: THIRD_PARTY_LOG
    product: Microsoft
    definition: THIRDPARTY_THIRDPARTY
detection:
    string_condition_0:
        eventCategory: Alert*
    string_condition_1:
        alertTitle: AD reconnaissance activities*
    condition: string_condition_0 and string_condition_1
level: info
taxonomy: tm-v1
