title: Attack Surface Reduction - Lsass Credential Theft Blocked
description: Microsoft Detection for LSASS Credential Theft Blocked.
tags: []
logsource:
    category: THIRD_PARTY_LOG
    product: Microsoft
    definition: THIRDPARTY_THIRDPARTY
detection:
    ec:
        eventCategory: 'DeviceEvents'
    ac:
        actionName: 'AsrLsassCredentialTheftBlocked'
    condition: ec and ac
level: info
taxonomy: tm-v1
