title: CertUtil Remote Download
description: Custom Microsoft Filter Detection for CertUtil Remote Download
tags: []
logsource:
    category: THIRD_PARTY_LOG
    product: Microsoft
    definition: THIRDPARTY_THIRDPARTY
detection:
    ec:
        eventCategory: DeviceProcessEvents
    s1:
        objectCmd|contains|all: 
            - "http"
            - "urlcache"
            - "-f"
    condition: ec and s1
level: info
taxonomy: tm-v1
