title: Command Line Used for Possible Overpass-The-Hash
description: MDE Detection for Command line used for possible overpass-the-hash
tags: []
logsource:
    category: THIRD_PARTY_LOG
    product: Microsoft
    definition: THIRDPARTY_THIRDPARTY
detection:
    string_condition_0:
        eventCategory: Alert*
    string_condition_1:
        alertTitle: Command line used for possible overpass-the-hash*
    condition: string_condition_0 and string_condition_1
level: info
taxonomy: tm-v1
