title: Event Log Cleared
description: Microsoft Detection for Event Log Cleared
tags: []
logsource:  
    category: THIRD_PARTY_LOG  
    product: Microsoft  
    definition: THIRDPARTY_THIRDPARTY  
detection:  
    string_condition_0:
        eventCategory: Alert*
    string_condition_1:
        alertTitle: "*Event log cleared*"
    condition: string_condition_0 and string_condition_1
level: info  
taxonomy: tm-v1
