title: Execution of Remote Payload via WebDAV
description: Microsoft telemetry detection for suspicious executions where iediagcmd.exe loads files from attacker-controlled WebDAV paths over non-standard ports. This behavior is commonly linked to exploitation chains and remote payload staging.
tags:
  - mitre.t1105
logsource:
  category: THIRD_PARTY_LOG
  product: Microsoft
  definition: THIRDPARTY_THIRDPARTY
detection:
  s1:
    eventCategory: 'DeviceProcessEvents'
  s2:
    processFilePath: '*\iediagcmd.exe'
  s3:
    objectFilePath: '*\DavWWWRoot\*'
    objectFilePath: '*.exe'
    objectFilePath|re: '\\\\[0-9]{1,3}(\.[0-9]{1,3}){3}@[0-9]{1,5}\\'
  condition: s1 and s2 and s3
level: info
taxonomy: tm-v1
