title: Firewall Outbound Connection Blocked
description: Microsoft Detection for Firewall Outbound Connection Blocked
tags: []
logsource:
    category: THIRD_PARTY_LOG
    product: Microsoft
    definition: THIRDPARTY_THIRDPARTY
detection:
    ec:
        eventCategory: 'DeviceEvents'
    s1:
        actionName: 'FirewallOutboundConnectionBlocked'
    condition: ec and s1
level: info
taxonomy: tm-v1