title: Hacktool in a PowerShell Script was Prevented from Executing via AMSI
description: Microsoft Detection for hacktool in a PowerShell script was prevented from executing via AMSI
tags: []
logsource:
    category: THIRD_PARTY_LOG
    product: Microsoft
    definition: THIRDPARTY_THIRDPARTY
detection:
    string_condition_0:
        eventCategory: Alert*
    string_condition_1:
        alertTitle: hacktool in a PowerShell script was prevented from executing via AMSI*
    condition: string_condition_0 and string_condition_1
level: info
taxonomy: tm-v1
