title: Hacktool Prevented
description: Microsoft Detection for Hacktool was Prevented
tags: []
logsource:
    category: THIRD_PARTY_LOG
    product: Microsoft
    definition: THIRDPARTY_THIRDPARTY
detection:
    ec:
        eventCategory: Alert*
    s1:
        alertTitle: "*hacktool was prevented*"
    condition: ec and s1
level: info
taxonomy: tm-v1
