title: Malicious File Uploaded to Storage Account
description: Microsoft Detection for Malicious file uploaded to storage account
tags: []
logsource:
    category: THIRD_PARTY_LOG
    product: Microsoft
    definition: THIRDPARTY_THIRDPARTY
detection:
    string_condition_0:
        eventCategory: Alert*
    string_condition_1:
        alertTitle: Malicious file uploaded to storage account*
    condition: string_condition_0 and string_condition_1
level: info
taxonomy: tm-v1
