title: Microsoft Application Control - Executable Audited
description: Microsoft Application Control detected the use of an untrusted executable. This detection identifies attempts to run potentially malicious or unauthorized executables that were allowed to proceed but logged for auditing purposes.
tags:
  - mitre.t1218
logsource:
  category: THIRD_PARTY_LOG
  product: Microsoft
  definition: THIRDPARTY_THIRDPARTY
detection:
  selection1:
    eventCategory: 'DeviceEvents'
  selection2:
    actionName: 'AppControlExecutableAudited'
  condition: selection1 and selection2
level: info
taxonomy: tm-v1
