title: Microsoft Application Control - Script Blocked
description: Microsoft Application Control blocked the use of an untrusted script. This detection identifies attempts to run potentially malicious or unauthorized scripts that were prevented from executing by application control policies.
tags:
  - mitre.t1059
  - mitre.t1562.001
logsource:
  category: THIRD_PARTY_LOG
  product: Microsoft
  definition: THIRDPARTY_THIRDPARTY
detection:
  selection1:
    eventCategory: 'DeviceEvents'
  selection2:
    actionName: 'AppControlScriptBlocked'
  condition: selection1 and selection2
level: info
taxonomy: tm-v1
