title: Microsoft Controlled Folder Access Violation Blocked
description: Microsoft telemetry detection that identifies when Microsoft Defender Controlled Folder Access violations are blocked, where unauthorized processes attempt to modify protected folders, commonly associated with ransomware activity.
tags:
  - mitre.t1486
logsource:
  category: THIRD_PARTY_LOG
  product: Microsoft
  definition: THIRDPARTY_THIRDPARTY
detection:
  selection1:
    eventCategory: 'DeviceEvents'
  selection2:
    actionName: 'ControlledFolderAccessViolationBlocked'
  condition: selection1 and selection2
level: info
taxonomy: tm-v1
