title: Microsoft Defender Antivirus Tampering
description: MDE Detection for Microsoft Defender Antivirus tampering
tags: []
logsource:  
    category: THIRD_PARTY_LOG  
    product: Microsoft
    definition: THIRDPARTY_THIRDPARTY  
detection:  
    et:  
        eventCategory: Alert*
    title:  
        alertTitle: *Microsoft Defender Antivirus tampering*
    condition: et and title
level: info  
taxonomy: tm-v1  
