title: MSHTA Executes Remote HTML Application
description: Microsoft telemetry detection identifying mshta.exe execution with command lines referencing remote URLs (HTTP/HTTPS). This behavior is commonly used to download and execute scripts or payloads directly from external servers.
tags:
- mitre.t1218.005
- mitre.t1105
logsource:
  category: THIRD_PARTY_LOG
  product: Microsoft
  definition: THIRDPARTY_THIRDPARTY
detection:
  s1:
    eventCategory: 'DeviceProcessEvents'
  s2:
    objectFileName: 'mshta.exe'
  s3:
    objectCmd: 
      - '*http:*'
      - '*https:*'
  condition: s1 and s2 and s3
level: info
taxonomy: tm-v1

