title: MSHTA Execution Initiated by Office Application
description: Microsoft telemetry detection identifying when mshta.exe is launched by Microsoft Office applications (Word, Excel, PowerPoint, OneNote, Outlook). This may indicate document-based execution, macro abuse, or phishing-related activity.
tags:
  - mitre.t1218.005
  - mitre.t1566.001
logsource:
  category: THIRD_PARTY_LOG
  product: Microsoft
  definition: THIRDPARTY_THIRDPARTY
detection:
  selection1:
    eventCategory: 'DeviceProcessEvents'
  selection2:
    objectFileName: 'mshta.exe'
  selection3:
    processName: 
        - 'winword.exe'
        - 'excel.exe'
        - 'powerpnt.exe'
        - 'onenote.exe'
        - 'outlook.exe'
  condition: selection1 and selection2 and selection3
level: info
taxonomy: tm-v1

