title: Office Application Code Injection into Other Processes Blocked
description: Microsoft attack surface reduction rule that prevents Office applications from injecting code into other processes. This detection identifies when Office apps attempt to use process injection techniques commonly employed by attackers to hide malicious payloads or migrate code execution to other processes.
tags:
- mitre.t1055
- mitre.t1055.012
logsource:
  category: THIRD_PARTY_LOG
  product: Microsoft
  definition: THIRDPARTY_THIRDPARTY
detection:
  selection1:
    actionName: 'AsrOfficeProcessInjectionBlocked'
  selection2:
    eventCategory: 'DeviceEvents'
  condition: selection1 and selection2
level: info
taxonomy: tm-v1


