title: Office Communication Application Child Process Creation Blocked
description: Microsoft attack surface reduction rule that prevents Office communication
  applications like Outlook from creating child processes to block potential exploit
  chains initiated through email or messaging applications.
tags:
- mitre.t1566
- mitre.t1055
- mitre.t1059
logsource:
  category: THIRD_PARTY_LOG
  product: Microsoft
  definition: THIRDPARTY_THIRDPARTY
detection:
  selection1:
    actionName: 'AsrOfficeCommAppChildProcessBlocked'
  selection2:
    eventCategory: 'DeviceEvents'
  condition: selection1 and selection2
level: info
taxonomy: tm-v1

