title: Possible ongoing hands-on-keyboard activity (Cobalt Strike)
description: Microsoft Detection for Possible ongoing hands-on-keyboard activity (Cobalt Strike)
tags: []
logsource:
    category: THIRD_PARTY_LOG
    product: Microsoft
    definition: THIRDPARTY_THIRDPARTY
detection:
    ec:
        eventCategory: Alert*
    s1:
        alertTitle: Possible ongoing hands-on-keyboard activity (Cobalt Strike)*
    condition: ec and s1
level: info
taxonomy: tm-v1
