title: Possible theft of passwords and other sensitive web browser information
description: Microsoft Detection for Possible theft of passwords and other sensitive web browser information
tags: []
logsource:
    category: THIRD_PARTY_LOG
    product: Microsoft
    definition: THIRDPARTY_THIRDPARTY
detection:
    ec:
        eventCategory: Alert*
    s1:
        alertTitle: Possible theft of passwords and other sensitive web browser information*
    condition: ec and s1
level: info
taxonomy: tm-v1
