title: PowerShell Base64 Decoding Command Execution Detected via Microsoft Telemetry
description: Microsoft detection for PowerShell processes executing Base64 decoded commands, which is a common obfuscation technique used by attackers to hide malicious payloads and evade security controls. It detects suspicious process execution events where Base64 decoding functions are invoked, indicating potential malware deployment or unauthorized command execution.
tags:
- mitre.t1059
- mitre.t1027
- mitre.t1140
logsource:
  category: THIRD_PARTY_LOG
  product: Microsoft
  definition: THIRDPARTY_THIRDPARTY
detection:
  s1:
    eventCategory: 'DeviceProcessEvents'
  s2:
    objectCmd: '*.decode(''base64'')*'
  s3:
    objectCmd: '*.b64decode(*'
  s4:
    objectCmd: '*base64 --decode*'
  s5:
    objectCmd: '*.decode64(*'
  condition: s1 and (s2 or s3 or s4 or s5)
level: info
taxonomy: tm-v1


