title: Process Memory Dump
description: Microsoft Detection for Process memory dump
tags: []
logsource:  
    category: THIRD_PARTY_LOG  
    product: Microsoft
    definition: THIRDPARTY_THIRDPARTY  
detection:  
    et:  
        eventCategory: Alert*
    title:  
        alertTitle: Process memory dump*
    condition: et and title
level: info  
taxonomy: tm-v1  

