title: Process Related to Possible AD Reconnaissance
description: Microsoft Detection for AD reconnaissance activities
tags: []
logsource:  
    category: THIRD_PARTY_LOG  
    product: Microsoft
    definition: THIRDPARTY_THIRDPARTY  
detection:  
    et:  
        eventCategory: Alert*
    title:  
        alertTitle: "*AD reconnaissance activities*"
    condition: et and title
level: info  
taxonomy: tm-v1
