title: PSExec and WMI Child Process Creation Blocked by Microsoft
description: Microsoft attack surface reduction rule that blocks process creations originating from PSExec and WMI commands which are commonly used for remote execution and lateral movement activities.
tags:
- mitre.t1021.002
- mitre.t1047
logsource:
  category: THIRD_PARTY_LOG
  product: Microsoft
  definition: THIRDPARTY_THIRDPARTY
detection:
  selection1:
    actionName: 'AsrPsexecWmiChildProcessBlocked'
  selection2:
    eventCategory: 'DeviceEvents'
  condition: selection1 and selection2
level: info
taxonomy: tm-v1


