title: Remote exfiltration activity
description: Microsoft Detection for Remote Exfiltration activity
tags: []
logsource:
    category: THIRD_PARTY_LOG
    product: Microsoft
    definition: THIRDPARTY_THIRDPARTY
detection:
    ec:
        eventCategory: Alert*
    s1:
        alertTitle: Remote exfiltration activity*
    condition: ec and s1
level: info
taxonomy: tm-v1
