title: Remote Desktop Connection 
description: Microsoft Detection for Security Group Deleted
tags: []
logsource:
    category: THIRD_PARTY_LOG
    product: Microsoft
    definition: THIRDPARTY_THIRDPARTY
detection:
    ec:
        eventCategory: 'DeviceEvents'
    s1:
        actionName: 'RemoteDesktopConnection'
    condition: ec and s1
level: info
taxonomy: tm-v1