title: Rundll32 Executing from Non-System Folder
description: Microsoft Detection for Rundll32 Executing from Non-System Folder
tags: []
logsource:
    category: THIRD_PARTY_LOG
    product: Microsoft
    definition: THIRDPARTY_THIRDPARTY
detection:
    string_condition_0:
        eventCategory: DeviceProcessEvents
    string_condition_1:
        objectFileName: 'rundll32.exe'
    string_condition_2:
        objectFilePath: '*System32*'
    condition: string_condition_0 and string_condition_1 and not string_condition_2
level: info
taxonomy: tm-v1
