title: Scheduled Task Created
description: Microsoft Detection for Scheduled Task Created
tags: []
logsource:
    category: THIRD_PARTY_LOG
    product: Microsoft
    definition: THIRDPARTY_THIRDPARTY
detection:
    ec:
        eventCategory: 'DeviceEvents'
    s1:
        actionName: 'ScheduledTaskCreated'
    condition: ec and s1
level: info
taxonomy: tm-v1