title: Scheduled Task Enabled
description: Microsoft Detection for Scheduled Task Enabled
tags: []
logsource:
    category: THIRD_PARTY_LOG
    product: Microsoft
    definition: THIRDPARTY_THIRDPARTY
detection:
    ec:
        eventCategory: 'DeviceEvents'
    s1:
        actionName: 'ScheduledTaskEnabled'
    condition: ec and s1
level: info
taxonomy: tm-v1