title: Security Software was Disabled
description: Microsoft for Security software was disabled
tags: []
logsource:  
    category: THIRD_PARTY_LOG  
    product: Microsoft
    definition: THIRDPARTY_THIRDPARTY  
detection:  
    et:  
        eventCategory: Alert*
    title:  
        alertTitle: Security software was disabled*
    condition: et and title
level: info  
taxonomy: tm-v1  
