title: Sensitive File Read
description: Microsoft Detection for Sensitive File Read
tags: []
logsource:
    category: THIRD_PARTY_LOG
    product: Microsoft
    definition: THIRDPARTY_THIRDPARTY
detection:
    ec:
        eventCategory: 'DeviceEvents'
    s1:
        actionName: 'SensitiveFileRead'
    condition: ec and s1
level: info
taxonomy: tm-v1