title: SmartScreen User Override
description: Microsoft Detection for SmartScreen User Override
tags: []
logsource:
    category: THIRD_PARTY_LOG
    product: Microsoft
    definition: THIRDPARTY_THIRDPARTY
detection:
    ec:
        eventCategory: 'DeviceEvents'
    s1:
        actionName: 'SmartScreenUserOverride'
    condition: ec and s1
level: info
taxonomy: tm-v1