title: Sticky Keys Binary Hijack Detected
description: Microsoft Detection for Sticky Keys binary hijack detected
tags: []
logsource:  
    category: THIRD_PARTY_LOG  
    product: Microsoft
    definition: THIRDPARTY_THIRDPARTY  
detection:  
    et:  
        eventCategory: Alert*
    title:  
        alertTitle: Sticky Keys binary hijack detected*
    condition: et and title
level: info  
taxonomy: tm-v1
