title: Successful Logon Using Overpass-the-Hash with Potentially Stolen Credentials
description: MDE Detection for Successful logon using overpass-the-hash with potentially stolen credentials
tags: []
logsource:  
    category: THIRD_PARTY_LOG  
    product: Microsoft
    definition: THIRDPARTY_THIRDPARTY  
detection:  
    et:  
        eventCategory: Alert* 
    title:  
        alertTitle: Successful logon using overpass-the-hash with potentially stolen credentials*
    condition: et and title
level: info  
taxonomy: tm-v1