title: Suspicious Behavior by cmd.exe was Observed
description: Microsoft Detection for Suspicious behavior by cmd.exe was observed
tags: []
logsource:
    category: THIRD_PARTY_LOG
    product: Microsoft
    definition: THIRDPARTY_THIRDPARTY
detection:
    ec:
        eventCategory: Alert*
    s1:
       alertTitle: 'Suspicious behavior by cmd.exe was observed' 
    condition: ec and s1
level: info
taxonomy: tm-v1
