title: Suspicious Hacking Tool Detected
description: Microsoft Detection for Suspicious Hacking Tool Detected
tags: []
logsource:
    category: THIRD_PARTY_LOG
    product: Microsoft
    definition: THIRDPARTY_THIRDPARTY
detection:
    ec:
        eventCategory: Alert*
    s1:
        alertTitle: *tool* #"Credential Theft Tool, Post-Exploitation Tool"
    condition: ec and s1
level: info
taxonomy: tm-v1
