title: Suspicious Download using Powershell Identified by Microsoft
description: Microsoft detection for suspicious PowerShell activity where PowerShell executables are used with commands commonly associated with downloading files or executing remote code from web sources. It detects potential malware delivery, fileless attacks, or unauthorized remote script execution attempts that leverage PowerShell web download capabilities.
tags:
- mitre.t1105
- mitre.t1059.001
- mitre.t1140
logsource:
  category: THIRD_PARTY_LOG
  product: Microsoft
  definition: THIRDPARTY_THIRDPARTY
detection:
  s1:
    eventCategory: 'DeviceProcessEvents'
  s2:
    objectFileName: 'powershell.exe'
  s3:
    objectCmd: '*Net.WebClient*'
  c1:
    objectCmd: '*DownloadFile*'
  c2:
    objectCmd: '*Invoke-WebRequest*'
  c3:
    objectCmd: '*Invoke-Shellcode*'
  c4:
    objectCmd: '*http*'
  c5:
    objectCmd: '*IEX*'
  c6:
    objectCmd: '*Start-BitsTransfer*'
  c7:
    objectCmd: '*mpcmdrun.exe*'
  condition: s1 and s2 and (c1 or c2 or c3 or c4 or c5 or
    c6 or c7)
level: info
taxonomy: tm-v1


