title: Suspicious Script Launched
description: Microsoft Detection for Suspicious script launched
tags: []
logsource:  
    category: THIRD_PARTY_LOG  
    product: Microsoft  
    definition: THIRDPARTY_THIRDPARTY  
detection:  
    et:  
        eventCategory: Alert*
    title:  
        alertTitle: Suspicious script launched*
    condition: et and title
level: info  
taxonomy: tm-v1
