title: Suspicious Lsass Process Access
description: Microsoft Detection for Suspicious Lsass Process Access
tags: []
logsource:  
    category: THIRD_PARTY_LOG  
    product: Microsoft
    definition: THIRDPARTY_THIRDPARTY  
detection:  
    et:  
        eventCategory: Alert* 
    title:  
        alertTitle: Suspicious Lsass Process Access*
    condition: et and title
level: info  
taxonomy: tm-v1
