title: Suspected Overpass-the-Hash Attack
description: Microsoft Detection for Suspected overpass-the-hash attack
tags: []
logsource:  
    category: THIRD_PARTY_LOG  
    product: Microsoft
    definition: THIRDPARTY_THIRDPARTY  
detection:  
    et:  
        eventCategory: Alert*
    title:  
        alertTitle: Suspected overpass-the-hash attack*
    condition: et and title
level: info  
taxonomy: tm-v1
