title: Suspicious Key Vault Recovery Detected
description: Microsoft Detection for Suspicious Key Vault Recovery Detected
tags: []
logsource:  
    category: THIRD_PARTY_LOG  
    product: Microsoft
    definition: THIRDPARTY_THIRDPARTY  
detection:  
    et:  
        eventCategory: Alert* 
    title:  
        alertTitle: Suspicious key vault recovery detected*
    condition: et and title
level: info  
taxonomy: tm-v1  
