title: Suspicious SQLPS Execution
description: Detects suspicious execution of SQLPS, which is often used in PowerShell attacks.
tags: []
logsource:
    category: THIRD_PARTY_LOG
    product: Microsoft
    definition: THIRDPARTY_THIRDPARTY
detection:
    ec:
        eventCategory: 'DeviceProcessEvents'
    proc:
        processFilePath: '*sqlps.exe*'    
    cmd:
        processCmd:  '*Invoke-WebRequest*http*.exe'
    condition: ec and proc and cmd
level: info
taxonomy: tm-v1
