title: Suspicious Azure Role Assignment Detected
description: Microsoft Detection for Suspicious Azure role assignment detected
tags: []
logsource:  
    category: THIRD_PARTY_LOG  
    product: Microsoft
    definition: THIRDPARTY_THIRDPARTY  
detection:  
    et:  
        eventCategory: Alert*
    title:  
        alertTitle: Suspicious Azure role assignment detected*
    condition: et and title
level: info  
taxonomy: tm-v1  
