title: System Information Discovery Activity via Microsoft Telemetry
description: Microsoft telemetry detection that identifies processes executing commands to enumerate system information including hardware identifiers usernames and computer names. This rule detects reconnaissance activity where attackers or malicious scripts use Windows Management Instrumentation and environment variables to gather host details for profiling or further malicious actions.
tags:
- mitre.t1082
logsource:
  category: THIRD_PARTY_LOG
  product: Microsoft
  definition: THIRDPARTY_THIRDPARTY
detection:
  s1:
    eventCategory: 'DeviceProcessEvents'

  # processCmd must match all three patterns
  p1:
    processCmd: '*Win32_ComputerSystemProduct*'
  p2:
    processCmd: '*USERNAME*'
  p3:
    processCmd: '*COMPUTERNAME*'

  # objectCmd must match all three patterns
  o1:
    objectCmd: '*Win32_ComputerSystemProduct*'
  o2:
    objectCmd: '*USERNAME*'
  o3:
    objectCmd: '*COMPUTERNAME*'
  condition: s1 and ((p1 and p2 and p3) or (o1 and o2 and o3))
level: info
taxonomy: tm-v1


