title: System Information Discovery Activity via Microsoft Telemetry
description: Microsoft telemetry detection that identifies processes executing commands
  to enumerate system information including hardware identifiers usernames and computer
  names. This rule detects reconnaissance activity where attackers or malicious scripts
  use Windows Management Instrumentation and environment variables to gather host
  details for profiling or further malicious actions.
tags:
- mitre.t1082
logsource:
  category: THIRD_PARTY_LOG
  product: Microsoft
  definition: THIRDPARTY_THIRDPARTY
detection:
  s1:
    eventCategory: 'DeviceProcessEvents'
  s2:
    processCmd: '*Win32_ComputerSystemProduct*'
  s3:
    processCmd: '*USERNAME*'
  s4:
    processCmd: '*COMPUTERNAME*'
  s5:
    objectCmd: '*Win32_ComputerSystemProduct*'
  s6:
    objectCmd: '*USERNAME*'
  s7:
    objectCmd: '*COMPUTERNAME*'
  condition: s1 and ((s2 and s3 and s4) or (s5 and s6 and s7))
level: low
taxonomy: tm-v1
