title: Untrusted USB Process Execution Blocked by Microsoft
description: Microsoft attack surface reduction rule that blocks execution of unsigned or untrusted processes launched from USB removable drives to prevent malware propagation and unauthorized code execution.
tags:
- mitre.t1091
- mitre.t1204
logsource:
  category: THIRD_PARTY_LOG
  product: Microsoft
  definition: THIRDPARTY_THIRDPARTY
detection:
  selection1:
    actionName: 'AsrUntrustedUsbProcessBlocked'
  selection2:
    eventCategory: 'DeviceEvents'
  condition: selection1 and selection2
level: info
taxonomy: tm-v1


