title: Unwanted Software Identified by Microsoft
description: Microsoft Detection for Unwanted Software Identified by Microsoft.
tags: 
    - mitre.t1595.002
logsource:
    category: THIRD_PARTY_LOG
    product: Microsoft
    definition: THIRDPARTY_THIRDPARTY
detection:
    ec:
        eventCategory: 'DeviceEvents'
    ac:
        actionName: 'Antivirus*'
    mal:
        malName:
            - 'Adware*'
            - 'BrowserModifier*'
            - 'Misleading*'
            - 'Program*'
            - 'SoftwareBundle*'
            - 'UwS*'
    condition: ec and ac and mal
level: info
taxonomy: tm-v1
