title: Unwanted Software Detected
description: Microsoft Detection for Unwanted Software Detected
tags: []
logsource:
    category: THIRD_PARTY_LOG
    product: Microsoft
    definition: THIRDPARTY_THIRDPARTY
detection:
    ec:
        eventCategory: Alert*
    s1:
        alertTitle: *unwanted software was detected*
    condition: ec and s1
level: info
taxonomy: tm-v1
