title: Unwanted Software Prevented
description: Microsoft Detection for Unwanted Software Prevented
tags: []
logsource:
    category: THIRD_PARTY_LOG
    product: Microsoft
    definition: THIRDPARTY_THIRDPARTY
detection:
    ec:
        eventCategory: Alert*
    s1:
        alertTitle: "*unwanted software was prevented*"
    condition: ec and s1
level: info
taxonomy: tm-v1
