title: Use of LOLBins to Execute Scripts 
description: Microsoft Detection for Use of LOLBins to Execute Scripts 
tags: []
logsource:
    category: THIRD_PARTY_LOG
    product: Microsoft
    definition: THIRDPARTY_THIRDPARTY
detection:
    string_condition_0:
        eventCategory: DeviceProcessEvents
    string_condition_1:
        objectFileName: 
        - 'rundll32.exe'
        - 'regsvr32.exe'
    string_condition_2:
        objectCmd: 
        - '*.js*'
        - '*.vbs*'
        - '*http*'
        - '*https*'
    condition: string_condition_0 and string_condition_1 and string_condition_2
level: info
taxonomy: tm-v1
