title: Alarm Management - Account Event
description: Dell detection for user login and accounting event was raised.
references:
    - https://dl.dell.com/content/manual23434279-dell-smartfabric-os10-system-log-message-reference.pdf?language=en-us
tags: []
logsource:
    category: THIRD_PARTY_LOG
    product: Dell
    definition: THIRDPARTY_THIRDPARTY
detection:
    string_condition_0:
        eventName: '*ALM_ACCNT_EVENT*'
    condition: string_condition_0
level: info
taxonomy: tm-v1
