title: Alarm Management - History Purged
description: Dell detection for older version of the alarm history will be purged.
references:
    - https://dl.dell.com/content/manual23434279-dell-smartfabric-os10-system-log-message-reference.pdf?language=en-us
tags: []
logsource:
    category: THIRD_PARTY_LOG
    product: Dell
    definition: THIRDPARTY_THIRDPARTY
detection:
    string_condition_0:
        eventName: '*ALM_HISTORY_PURGED*'
    condition: string_condition_0
level: info
taxonomy: tm-v1
