title: Virtual Link Trunking - Port Channel Up
description: Dell detection for VLT LAG is operationally UP in one of the VLT peers.
references:
    - https://dl.dell.com/content/manual23434279-dell-smartfabric-os10-system-log-message-reference.pdf?language=en-us
tags: []
logsource:
    category: THIRD_PARTY_LOG
    product: Dell
    definition: THIRDPARTY_THIRDPARTY
detection:
    string_condition_0:
        eventName: '*BFD_STATE_CHANGE*'
    condition: string_condition_0
level: info
taxonomy: tm-v1
