title: ActiveCampaign 1-2-All Admin Panel Username Parameter SQL Injection
description: Palo Alto Networks detection for ActiveCampaign 1-2-All Admin Panel Username Parameter SQL Injection
tags: []
logsource:
  definition: THIRDPARTY_THIRDPARTY
  category: THIRD_PARTY_LOG
  product: PALO ALTO NETWORKS
detection:
  subname:
    eventSubName: vulnerability
  rule:
    ruleName: ActiveCampaign 1-2-All Admin Panel Username Parameter SQL Injection*
  severity:
    severity: '8'
  condition: subname and rule and severity and not action
level: info
taxonomy: tm-v1
