title: Cobalt Strike Command and Control Traffic Alert
description: Palo Alto Networks detection for Cobalt Strike Command and Control Traffic Detection. This signature detects CobaltStrike.Gen Malicious Payload.
tags: []
logsource:
  definition: THIRDPARTY_THIRDPARTY
  category: THIRD_PARTY_LOG
  product: PALO ALTO NETWORKS
detection:
  subname:
    eventSubName: vulnerability
  rule:
    ruleId:
    - '11001'
    - '11018'
    - '12067'
    - '13012'
  condition: subname and rule
level: info
taxonomy: tm-v1
