title: Compromised credentials from data breach in inbound FTP login
description: Palo Alto Networks detection for Compromised username and/or password from previous data breach in inbound FTP login. An FTP login attempt from a device was detected with a compromised password. A compromised password is a user credential that has been previously stolen, collected and used for unauthorized logins with an intention to perform a malicious act. An attacker can steal a credential by leveraging on a phishing attack, an installed spyware or another type of exploit. This detection is based on a compromised credential database created from the external input of the security research community. The continuous use of an already compromised password is a security risk.
tags: []
logsource:
  definition: THIRDPARTY_THIRDPARTY
  category: THIRD_PARTY_LOG
  product: Palo Alto Networks
detection:
  mappingtable:
    eventSubName: vulnerability
    ruleId:
    - '58203'
    - '59570'
    - '59527'
    act:
    - drop
  condition: mappingtable
level: info
taxonomy: tm-v1
