title: Data Exfiltration Traffic Alert
description: Palo Alto Networks detection for Data Exfiltration Traffic Detection. This signature detects data exfiltration traffic generated during a supply chain attack targeting continuous integration and deployment (CI/CD) infrastructure. The traffic covered by this signature was observed in the April 2021 supply chain attack against the software company Codecov.
tags: []
logsource:
  definition: THIRDPARTY_THIRDPARTY
  category: THIRD_PARTY_LOG
  product: PALO ALTO NETWORKS
detection:
  subname:
    eventSubName: vulnerability
  rule:
    ruleId:
    - '18084'
    - '18227'
    - '18564'
    - '18563'
    - '86355'
    - '86512'
    - '86908'
    - '86939'
    - '86961'
    - '87005'
    - '87006'
  condition: subname and rule
level: info
taxonomy: tm-v1
