title: Delta Industrial Automation Diaenergie SQL Injection Vulnerbility
description: Palo Alto Networks detection for Delta Industrial Automation Diaenergie SQL Injection Vulnerbility. Delta Industrial Automation Diaenergie is prone to a SQL injection vulnerability while parsing certain crafted HTTP requests. The vulnerability is due to the lack of proper checks on HTTP requests, leading to an exploitable SQL injection vulnerability. An attacker could exploit the vulnerability by sending a crafted HTTP request. A successful attack could lead to remote code execution with the privileges of the server.
tags:
- cve.2021.38391
logsource:
  definition: THIRDPARTY_THIRDPARTY
  category: THIRD_PARTY_LOG
  product: Palo Alto Networks
detection:
  mappingtable:
    eventSubName: vulnerability
    ruleId:
    - '91885'
    act:
    - alert
  condition: mappingtable
level: info
taxonomy: tm-v1
