title: Eicar File Detected
description: Palo Alto Vulnerability detection - Eicar File Detected
tags:
- mitre.t1190
logsource:
  definition: THIRDPARTY_THIRDPARTY
  category: THIRD_PARTY_LOG
  product: PALO ALTO NETWORKS
detection:
  subname:
    eventSubName: vulnerability
  rule:
    ruleName: Eicar File Detected*
  condition: subname and rule
level: info
taxonomy: tm-v1
