title: Email Link
description: Palo Alto Networks detection for Email Link. This file type is used to enable the email link forwarding feature.
tags: []
logsource:
  definition: THIRDPARTY_THIRDPARTY
  category: THIRD_PARTY_LOG
  product: Palo Alto Networks
detection:
  mappingtable:
    eventSubName: vulnerability
    act:
    - reset-both
    - reset-server
    - drop
    ruleId: '52143'
    severity: '8'
  condition: mappingtable
level: info
taxonomy: tm-v1
