title: File detection - Scalable Vector Graphics SVG File
description: Palo Alto File detection - Scalable Vector Graphics SVG File
tags:
- mitre.t1071.001
logsource:
  definition: THIRDPARTY_THIRDPARTY
  category: THIRD_PARTY_LOG
  product: PALO ALTO NETWORKS
detection:
  subname:
    eventSubName: file
  rule:
    ruleName: Scalable Vector Graphics SVG File*
  condition: subname and rule
level: info
taxonomy: tm-v1
