title: Generic Suspicious HTTP Request Discovery
description: Palo Alto Networks detection for Generic Suspicious HTTP Request Detection. This signature detects invalid chunk body size in HTTP traffic.
tags:
- cve.2024.21762
- cve.2024.0012
logsource:
  definition: THIRDPARTY_THIRDPARTY
  category: THIRD_PARTY_LOG
  product: PALO ALTO NETWORKS
detection:
  subname:
    eventSubName: vulnerability
  rule:
    ruleId:
    - '95107'
    - '95775'
  condition: subname and rule
level: info
taxonomy: tm-v1
