title: HTTP GET Requests Long URI Anomaly
description: Palo Alto Vulnerability detection - HTTP GET Requests Long URI Anomaly
tags:
- mitre.t1190
logsource:
  definition: THIRDPARTY_THIRDPARTY
  category: THIRD_PARTY_LOG
  product: PALO ALTO NETWORKS
detection:
  subname:
    eventSubName: vulnerability
  rule:
    ruleName: HTTP GET Requests Long URI Anomaly*
  condition: subname and rule and not action
level: info
taxonomy: tm-v1
