title: HTTP passwd Access Attempt
description: Palo Alto Vulnerability detection - HTTP passwd Access Attempt
tags:
- mitre.t1190
logsource:
  definition: THIRDPARTY_THIRDPARTY
  category: THIRD_PARTY_LOG
  product: PALO ALTO NETWORKS
detection:
  subname:
    eventSubName: vulnerability
  rule:
    ruleName: HTTP /etc/passwd Access Attempt*
  condition: subname and rule
level: info
taxonomy: tm-v1
