title: HTTP WWW-Authentication Failed
description: Palo Alto Vulnerability detection - HTTP WWW-Authentication Failed
tags:
- mitre.t1190
logsource:
  definition: THIRDPARTY_THIRDPARTY
  category: THIRD_PARTY_LOG
  product: PALO ALTO NETWORKS
detection:
  subname:
    eventSubName: vulnerability
  rule:
    ruleName: HTTP WWW-Authentication Failed*
  condition: subname and rule
level: info
taxonomy: tm-v1
