title: HTTP OPTIONS Method
description: Palo Alto Vulnerability detection - HTTP OPTIONS Method
tags:
- mitre.t1190
logsource:
  definition: THIRDPARTY_THIRDPARTY
  category: THIRD_PARTY_LOG
  product: PALO ALTO NETWORKS
detection:
  subname:
    eventSubName: vulnerability
  rule:
    ruleName: HTTP OPTIONS Method*
  condition: subname and rule
level: info
taxonomy: tm-v1
