title: IP Address Disclosure Detection
description: Palo Alto Vulnerability detection - IP Address Disclosure Detection
tags:
- mitre.t1190
logsource:
  definition: THIRDPARTY_THIRDPARTY
  category: THIRD_PARTY_LOG
  product: PALO ALTO NETWORKS
detection:
  subname:
    eventSubName: vulnerability
  rule:
    ruleName: IP Address Disclosure Detection*
  condition: subname and rule
level: info
taxonomy: tm-v1
