title: Korplug Command and Control Traffic Discovery
description: Palo Alto Networks detection for Korplug Command and Control Traffic Detection. This signature detects the command and control traffic from Korplug, which has been observed in Stately Taurus or Mustang Panda campaigns.
tags: []
logsource:
  definition: THIRDPARTY_THIRDPARTY
  category: THIRD_PARTY_LOG
  product: Palo Alto Networks
detection:
  mappingtable:
    eventSubName: spyware
    ruleId:
    - '86770'
    act:
    - reset-server
  condition: mappingtable
level: info
taxonomy: tm-v1
