title: 'LDAP: User Login Brute Force Attempt'
description: 'Palo Alto Networks detection for LDAP: User Login Brute Force Attempt. This event indicates that someone is using a brute force attack to gain access to windows through ldap bind request.'
tags: []
logsource:
  definition: THIRDPARTY_THIRDPARTY
  category: THIRD_PARTY_LOG
  product: PALO ALTO NETWORKS
detection:
  subname:
    eventSubName: vulnerability
  rule:
    ruleId: '40005'
  condition: subname and rule
level: info
taxonomy: tm-v1
