title: Microsoft Windows win.ini Access Attempt Detected
description: Palo Alto Vulnerability detection - Microsoft Windows win.ini Access
  Attempt Detected
tags:
- mitre.t1190
logsource:
  definition: THIRDPARTY_THIRDPARTY
  category: THIRD_PARTY_LOG
  product: PALO ALTO NETWORKS
detection:
  subname:
    eventSubName: vulnerability
  rule:
    ruleName: Microsoft Windows win.ini Access Attempt Detected*
  condition: subname and rule
level: info
taxonomy: tm-v1
