title: Microsoft Windows LDAP Remote Code Execution Attempt
description: Palo Alto Networks detection for Microsoft Windows LDAP Remote Code Execution Attempt. This signature is a child signature of the parent, ID 40167, Microsoft Windows LDAP Remote Code Execution Vulnerability.
tags:
- cve.2025.21376
logsource:
  definition: THIRDPARTY_THIRDPARTY
  category: THIRD_PARTY_LOG
  product: PALO ALTO NETWORKS
detection:
  subname:
    eventSubName: vulnerability
  rule:
    ruleId: '96001'
  condition: subname and rule
level: info
taxonomy: tm-v1
