title: Microsoft Windows MS17-010 Scanning Identified
description: Palo Alto Networks detection for Microsoft Windows MS17-010 Scanning Detection. This signature detects an attempted scan for Microsoft Windows MS17-010 related vulnerabilities CVE-2017-0143, CVE-2017-0145, and CVE-2017-0148. This kind of traffic is usually seen before the actual exploitation process.
tags:
- cve.2017.0145
- cve.2017.0143
- cve.2017.0148
logsource:
  definition: THIRDPARTY_THIRDPARTY
  category: THIRD_PARTY_LOG
  product: PALO ALTO NETWORKS
detection:
  subname:
    eventSubName: vulnerability
  rule:
    ruleId: '90807'
  condition: subname and rule
level: info
taxonomy: tm-v1
