title: Microsoft Windows NTLMSSP Detection
description: Palo Alto Vulnerability detection - Microsoft Windows NTLMSSP Detection
tags:
- mitre.t1190
logsource:
  definition: THIRDPARTY_THIRDPARTY
  category: THIRD_PARTY_LOG
  product: PALO ALTO NETWORKS
detection:
  subname:
    eventSubName: vulnerability
  rule:
    ruleName: Microsoft Windows NTLMSSP Detection*
  condition: subname and rule
level: info
taxonomy: tm-v1
