title: Microsoft DHCP Server Option Attempt
description: Palo Alto Networks detection for Microsoft DHCP Server Option Attempt. This signature detects Microsoft DHCP server option attempts in DHCP requests. The signature is a child signature of the parent, Microsoft DHCP Server Service Denial-of-Service Vulnerability (ID 40157). An individual trigger of this signature may not be malicious by itself. Normally, multiple triggers of this signature within a certain time period should be considered highly suspicious or malicious.
tags: []
logsource:
  definition: THIRDPARTY_THIRDPARTY
  category: THIRD_PARTY_LOG
  product: PALO ALTO NETWORKS
detection:
  subname:
    eventSubName: vulnerability
  rule:
    ruleId: '95173'
  condition: subname and rule
level: info
taxonomy: tm-v1
