title: NicheStack FTP Banner Discovery
description: Palo Alto Networks detection for NicheStack FTP Banner Detection. This signature detects a NicheStack FTP banner.
tags: []
logsource:
  definition: THIRDPARTY_THIRDPARTY
  category: THIRD_PARTY_LOG
  product: Palo Alto Networks
detection:
  mappingtable:
    eventSubName: vulnerability
    ruleId:
    - '91567'
    act:
    - alert
  condition: mappingtable
level: info
taxonomy: tm-v1
