title: Nmap Service Detection
description: Palo Alto Vulnerability detection - Nmap Service Detection
tags:
- mitre.t1190
logsource:
  definition: THIRDPARTY_THIRDPARTY
  category: THIRD_PARTY_LOG
  product: PALO ALTO NETWORKS
detection:
  subname:
    eventSubName: vulnerability
  rule:
    ruleName: Nmap Service Detection*
  condition: subname and rule and not action
level: info
taxonomy: tm-v1
