title: Non-RFC Compliant MS-DS-SMB Traffic on Port 445
description: Palo Alto Networks detection for Non-RFC Compliant MS-DS-SMB Traffic on Port 445. This signature detects suspicious and non-RFC compliant MS-DS-SMB traffic on port 445. This could be associated with applications sending non MS-DS-SMB traffic using port 445 or indicate possible malicious activity.
tags: []
logsource:
  definition: THIRDPARTY_THIRDPARTY
  category: THIRD_PARTY_LOG
  product: Palo Alto Networks
detection:
  mappingtable:
    eventSubName: vulnerability
    act:
    - reset-both
    - reset-server
    - drop
    ruleId:
    - '95608'
  condition: mappingtable
level: info
taxonomy: tm-v1
