title: Oracle Database User Authentication Brute Force Attempt
description: Palo Alto Networks detection for Oracle Database User Authentication Brute Force Attempt. This event indicates that someone is doing a brute force attack and try to authenticated to the Oracle database server.
tags: []
logsource:
  definition: THIRDPARTY_THIRDPARTY
  category: THIRD_PARTY_LOG
  product: PALO ALTO NETWORKS
detection:
  subname:
    eventSubName: vulnerability
  rule:
    ruleId: '40012'
  condition: subname and rule
level: info
taxonomy: tm-v1
