title: PAN-OS Firewall File Detection Blocked
description: Palo Alto Networks File Detection Blocked by PAN-OS Firewall
tags: []
logsource:
  definition: THIRDPARTY_THIRDPARTY
  category: THIRD_PARTY_LOG
  product: PALO ALTO NETWORKS
detection:
  action:
    act: '*alert*'
  filter:
    eventSubName: file
    ruleName: "*"
  condition: filter and not action
level: info
taxonomy: tm-v1
