title: PAN-OS Firewall Virus Detection Blocked
description: Palo Alto Networks Firewall Virus Detection by PAN-OS Firewall
tags: []
logsource:
  definition: THIRDPARTY_THIRDPARTY
  category: THIRD_PARTY_LOG
  product: PALO ALTO NETWORKS
detection:
  action:
    act: '*alert*'
  filter:
    eventSubName: virus
    ruleName: "*"
  condition: filter and not action
level: info
taxonomy: tm-v1
