title: PHP Suspicious File Inclusion Discovery
description: Palo Alto Networks detection for PHP Suspicious File Inclusion Detection. This signature detects suspicious PHP file inclusion traffic that related to CVE-2024-2961.
tags:
- cve.2024.2961
logsource:
  definition: THIRDPARTY_THIRDPARTY
  category: THIRD_PARTY_LOG
  product: PALO ALTO NETWORKS
detection:
  subname:
    eventSubName: vulnerability
  rule:
    ruleId: '95434'
  condition: subname and rule
level: info
taxonomy: tm-v1
