title: PNG File Chunk Length Abnormal
description: Palo Alto Vulnerability detection - PNG File Chunk Length Abnormal
tags:
- mitre.t1190
logsource:
  definition: THIRDPARTY_THIRDPARTY
  category: THIRD_PARTY_LOG
  product: PALO ALTO NETWORKS
detection:
  subname:
    eventSubName: vulnerability
  rule:
    ruleName: PNG File Chunk Length Abnormal*
  condition: subname and rule and not action
level: info
taxonomy: tm-v1
