title: RDP Tunneling Traffic Discovery
description: Palo Alto Networks detection for RDP Tunneling Traffic Detection. This signature detects a potential RDP Tunneling attempt.
tags: []
logsource:
  definition: THIRDPARTY_THIRDPARTY
  category: THIRD_PARTY_LOG
  product: PALO ALTO NETWORKS
detection:
  subname:
    eventSubName: vulnerability
  rule:
    ruleId: '91039'
  condition: subname and rule
level: info
taxonomy: tm-v1
