title: RPC Portmapper DUMP Request Detected
description: Palo Alto Vulnerability detection - RPC Portmapper DUMP Request Detected
tags:
- mitre.t1190
logsource:
  definition: THIRDPARTY_THIRDPARTY
  category: THIRD_PARTY_LOG
  product: PALO ALTO NETWORKS
detection:
  subname:
    eventSubName: vulnerability
  rule:
    ruleName: RPC Portmapper DUMP Request Detected*
  condition: subname and rule and not action
level: info
taxonomy: tm-v1
