title: Squid Proxy TRACE Request Denial of Service
description: Palo Alto Networks detection for Squid Proxy TRACE Request Denial of Service. Squid proxy is prone to a denial of service vulnerability while handling certain crafted HTTP requests. The vulnerability is due to a failure to handle exceptional conditions when processing an HTTP TRACE request. An attacker could exploit the vulnerability by sending a crafted HTTP TRACE request. A successful exploit could allow unauthenticated remote attackers to terminate a vulnerable Squid proxy server, creating a denial of service condition to legitimate users.
tags:
- cve.2007.1560
logsource:
  definition: THIRDPARTY_THIRDPARTY
  category: THIRD_PARTY_LOG
  product: PALO ALTO NETWORKS
detection:
  subname:
    eventSubName: vulnerability
  rule:
    ruleId: '31003'
  condition: subname and rule
level: info
taxonomy: tm-v1
