title: Suspicious Telerik Web UI Request
description: Palo Alto Networks detection for Suspicious Telerik Web UI Request. This signature detects suspicious Telerik Web UI requests. A successful attack could lead to an exploitable deserialization vulnerability by sending a crafted HTTP request.
tags: []
logsource:
  definition: THIRDPARTY_THIRDPARTY
  category: THIRD_PARTY_LOG
  product: Palo Alto Networks
detection:
  mappingtable:
    eventSubName: vulnerability
    ruleId:
    - '59014'
    act:
    - drop
  condition: mappingtable
level: info
taxonomy: tm-v1
