title: TLS Encrypted Client Hello Extension Detection
description: Palo Alto Vulnerability detection - TLS Encrypted Client Hello Extension
  Detection
tags:
- mitre.t1190
logsource:
  definition: THIRDPARTY_THIRDPARTY
  category: THIRD_PARTY_LOG
  product: PALO ALTO NETWORKS
detection:
  subname:
    eventSubName: vulnerability
  rule:
    ruleName: TLS Encrypted Client Hello Extension Detection*
  condition: subname and rule
level: info
taxonomy: tm-v1
