title: Critical Risk Reject Inbound Connection
description: Check Point Detection for detecting Critical Risk Reject Inbound Connection
tags: []
logsource:
  definition: THIRDPARTY_THIRDPARTY
  category: THIRD_PARTY_LOG
  product: CHECK POINT
detection:
  filter0:
    vendorParsed.severity: '5'
  filter1: 
    vendorParsed.act: 'Reject'
  filter2:
    vendorParsed.deviceDirection: '0'
  condition: filter0 and filter1 and filter2 
level: info
taxonomy: tm-v1