title: High Risk Reject Outbound Connection
description: Check Point Detection - detecting High Risk Reject Outbound Connection
tags: []
logsource:
  definition: THIRDPARTY_THIRDPARTY
  category: THIRD_PARTY_LOG
  product: CHECK POINT
detection:
  filter0:
    vendorParsed.severity: '4'
  filter1: 
    vendorParsed.act: 'Reject'
  filter2:
    vendorParsed.deviceDirection: '1'
  condition: filter0 and filter1 and filter2 
level: info
taxonomy: tm-v1
