title: Medium Risk Drop HTTP Connection
description: Check Point Detection - detecting Medium Risk Drop HTTP connection
tags: []
logsource:
  category: THIRD_PARTY_LOG
  definition: THIRDPARTY_THIRDPARTY
  product: CHECK POINT
detection:
  filter0:
    vendorParsed.severity: '3'
  filter1:
    vendorParsed.act: 'Drop'
  filter2:
    vendorParsed.app: 'HTTP'
  condition: filter0 and filter1 and filter2
level: info
taxonomy: tm-v1
