title: Medium Risk Drop HTTPS Connection
description: Check Point Detection for detecting Medium Risk Drop HTTPS connection
tags: []
logsource:
  category: THIRD_PARTY_LOG
  definition: THIRDPARTY_THIRDPARTY
  product: CHECK POINT
detection:
  filter0:
    vendorParsed.severity: '3'
  filter1:
    vendorParsed.act: 'Drop'
  filter2:
    vendorParsed.app: 'HTTPS'
  condition: filter0 and filter1 and filter2
level: info
taxonomy: tm-v1