title: Medium Risk Reject IMAPS Connection
description: Check Point Detection for detecting Medium Risk Reject IMAPS connection
tags: []
logsource:
  category: THIRD_PARTY_LOG
  definition: THIRDPARTY_THIRDPARTY
  product: CHECK POINT
detection:
  filter0:
    vendorParsed.severity: '3'
  filter1:
    vendorParsed.act: 'Reject'
  filter2:
    vendorParsed.app: 'IMAPS'
  condition: filter0 and filter1 and filter2
level: info
taxonomy: tm-v1