title: Active Device Manufactured by Company Banned for US Government Use
description: Asimily detection for active devices manufactured by companies banned for US government use. Detects when such a device is identified by Asimily's threat intelligence.
references: []
logsource:
    category: THIRD_PARTY_LOG
    product: Asimily
    definition: THIRDPARTY_THIRDPARTY
detection:
    string_condition_0:
        eventName: "*Active Device Manufactured by Company Banned for US Government Use*"
    condition: string_condition_0 
level: info
taxonomy: tm-v1