title: Browsing Blacklist Domain
description: Asimily detection for browsing blacklist domains. Detects when a device attempts to access a domain that has been flagged as malicious by Asimily's threat intelligence.
references: []
logsource:
    category: THIRD_PARTY_LOG
    product: Asimily
    definition: THIRDPARTY_THIRDPARTY
detection:
    string_condition_0:
        eventName: "*Browsing Blacklist Domain*"
    condition: string_condition_0 
level: info
taxonomy: tm-v1