title: DNS Lookup of Malicious Domain
description: Asimily detection for DNS lookups of malicious domains. Detects when a DNS lookup is made for a domain that has been flagged as malicious by Asimily's threat intelligence.
references: []
logsource:
    category: THIRD_PARTY_LOG
    product: Asimily
    definition: THIRDPARTY_THIRDPARTY
detection:
    string_condition_0:
        eventName: "*DNS Lookup of Malicious Domain*"
    condition: string_condition_0 
level: info
taxonomy: tm-v1