title: DNS Connection to External IP
description: Asimily detection for DNS connections to external IP addresses. Detects when a DNS connection is made to an IP address that has been flagged as external by Asimily's threat intelligence.
references: []
logsource:
    category: THIRD_PARTY_LOG
    product: Asimily
    definition: THIRDPARTY_THIRDPARTY
detection:
    string_condition_0:
        ruleName: "*DNS Connection to External IP*"
    condition: string_condition_0 
level: info
taxonomy: tm-v1