title: Insecure Communication - Expired SSL-TLS Certificate In Use
description: Asimily detection for devices using expired SSL-TLS certificates. Detects when a device attempts to use an expired SSL-TLS certificate, which is considered insecure.
references: []
logsource:
    category: THIRD_PARTY_LOG
    product: Asimily
    definition: THIRDPARTY_THIRDPARTY
detection:
    string_condition_0:
        category: "*Insecure Communication*"
        eventName: "*Expired SSL-TLS Certificate In Use*"
    condition: string_condition_0 
level: info
taxonomy: tm-v1