title: Telnet Connection to or from External IP
description: Asimily detection for Telnet connections to or from external IP addresses. Detects when a Telnet connection is made to or from an IP address that has been flagged as external by Asimily's threat intelligence.
references: []
logsource:
    category: THIRD_PARTY_LOG
    product: Asimily
    definition: THIRDPARTY_THIRDPARTY
detection:
    string_condition_0:
        eventName: '*Telnet Connection to*from External IP*'
    condition: string_condition_0 
level: info
taxonomy: tm-v1