title: DLL Injection Prevention Disabled 
description: TxOne Networks Detection for Disabling of DLL Injection Prevention
tags: []
logsource:
  category: THIRD_PARTY_LOG
  definition: THIRDPARTY_THIRDPARTY
  product: TXOne Networks
detection:
  selection:
    vendorParsed.deviceEventClassId: '4880'
    vendorParsed.deviceEventName: 'Agent Event'
    pname: 'StellarProtect'
  condition: selection
level: info
taxonomy: tm-v1