title: Legacy Mode Disable Integrity Monitoring
description: TxOne Networks Alert for Integrity Monitoring Disabled
tags: []
logsource:
  category: THIRD_PARTY_LOG
  definition: THIRDPARTY_THIRDPARTY
  product: TXOne Networks
detection:
  selection:
    vendorParsed.deviceEventClassId: '1077'
    vendorParsed.deviceEventName: 'Agent Event'
    pname: 'StellarProtect'
  condition: selection
level: info
taxonomy: tm-v1