title: Legacy Mode Incoming Files Detected and not Quarantined
description: TxOne Networks warning for  Incoming Files Detected and Quarantined Unsuccessfully.
tags: []
logsource:
  category: THIRD_PARTY_LOG
  definition: THIRDPARTY_THIRDPARTY
  product: TXOne Networks
detection:
  selection:
    vendorParsed.deviceEventClassId: '8013'
    vendorParsed.deviceEventName: 'Agent Event'
    pname: 'StellarProtect'
  condition: selection
level: info
taxonomy: tm-v1