title: Maintenance Mode Ended
description: TxOne Networks Detection for Disabling Maintenance Mode. During the Maintenance Mode, the agents allows all file executions and adds all files that are created, executed, or modified to the Approved List
tags: []
logsource:
  category: THIRD_PARTY_LOG
  definition: THIRDPARTY_THIRDPARTY
  product: TXOne Networks
detection:
  selection:
    vendorParsed.deviceEventClassId: '9217'
    vendorParsed.deviceEventName: 'Agent Event'
    pname: 'StellarProtect'
  condition: selection
level: info
taxonomy: tm-v1