title: Protection Disabled Manually Legacy Mode
description: TxOne Networks Detection for Protection Stopped Manually via Protection Stop Button or CLI on Legacy Mode
tags: []
logsource:
  category: THIRD_PARTY_LOG
  definition: THIRDPARTY_THIRDPARTY
  product: TXOne Networks
detection:
  selection:
    vendorParsed.deviceEventClassId: '1115'
    vendorParsed.deviceEventName: 'Agent Event'
    pname: 'StellarProtect'
  condition: selection
level: info
taxonomy: tm-v1