title: Configuration Write Attempt
description: You have entered the write command to store your configuration on a device (either floppy, flash memory, TFTP, the failover standby unit, or the console terminal). The IP address indicates whether the login was made at the console port or with a Telnet connection.
tags:
- mitre.t1078
logsource:
  definition: THIRDPARTY_THIRDPARTY
  category: THIRD_PARTY_LOG
  product: Cisco
detection:
  mappingtable:
    vendorLogId:
    - '111001'
  condition: mappingtable
level: info
taxonomy: tm-v1
