title: Interface Status Change - TYPE 411 0
description: The configuration status of the interface has changed from down to up.
tags:
- mitre.t1016
logsource:
  definition: THIRDPARTY_THIRDPARTY
  category: THIRD_PARTY_LOG
  product: Cisco
detection:
  mappingtable:
    vendorLogId:
    - '411003'
  condition: mappingtable
level: info
taxonomy: tm-v1
