title: IP SLA Monitor Scheduling Failure
description: The IPSLA monitor probe cannot be scheduled.
tags:
- mitre.t1016
logsource:
  definition: THIRDPARTY_THIRDPARTY
  category: THIRD_PARTY_LOG
  product: Cisco
detection:
  mappingtable:
    vendorLogId:
    - '422006'
  condition: mappingtable
level: info
taxonomy: tm-v1
