title: Potential Decryption Failure via Azure Secret Key
description: Cisco ASA Detection for Potential Decryption Failure via Azure Secret Key.
tags:
- mitre.t1003
logsource:
  definition: THIRDPARTY_THIRDPARTY
  category: THIRD_PARTY_LOG
  product: Cisco
detection:
  mappingtable:
    vendorLogId:
    - '105551'
  condition: mappingtable
level: info
taxonomy: tm-v1
