title: Replication Failure via Interface Mismatch
description: Replication of the name if command failed because the number of interfaces on the active and standby units is not the same.
tags:
- mitre.t1016
logsource:
  definition: THIRDPARTY_THIRDPARTY
  category: THIRD_PARTY_LOG
  product: Cisco
detection:
  mappingtable:
    vendorLogId:
    - '105041'
  condition: mappingtable
level: info
taxonomy: tm-v1
