title: Smart Call Home Response
description: The administrator was notified that a user has responded to the Smart Call Home prompt to enable, disable, or postpone anonymous reporting.
tags:
- mitre.t1078
logsource:
  definition: THIRDPARTY_THIRDPARTY
  category: THIRD_PARTY_LOG
  product: Cisco
detection:
  mappingtable:
    vendorLogId:
    - '120012'
  condition: mappingtable
level: info
taxonomy: tm-v1
