title: Possible Reverse Shell via Php to Remote Host
description: Detected a cron job that uses php to establish a reverse shell connection to a remote host. This technique is often used by attackers to gain remote access to a compromised system.
tags: []
logsource:
    category: THIRD_PARTY_LOG
    product: VMware
    definition: THIRDPARTY_THIRDPARTY
detection:
    parser:
        actualParserId: vrl.syslog.vmware.esxi.crond
    string_condition_0:
        objectCmd: '*\/usr\/bin\/php*'
        objectCmd: '*-r*'
        objectCmd: '*\/bin\/sh*'
        objectCmd: '*fsockopen*'
        objectCmd: '*exec*'
    condition: parser and string_condition_0
level: info
taxonomy: tm-v1
