title: Blocked Access to Hobbies and Leisure Websites
description: Detects when users attempt to access hobby and leisure-related websites that are blocked by organizational web filtering policies. This rule helps monitor compliance with acceptable use policies and identifies potential productivity concerns during business hours. Medium severity indicates moderate policy violation that may require management awareness or user education regarding appropriate internet usage in the workplace.
tags: []
logsource:
  definition: THIRDPARTY_THIRDPARTY
  category: THIRD_PARTY_LOG
  product: Zscaler
detection:
  mappingtable:
    category:
    - Hobbies/Leisure
    severity:
    - 3
    act:
    - Blocked
  condition: mappingtable
level: info
taxonomy: tm-v1
