title: Body Art Content Access Block
description: Detects and blocks access to body art and tattoo-related websites that may violate organizational content policies or consume excessive bandwidth during business hours. This filter helps maintain workplace productivity standards and ensures compliance with acceptable use policies regarding non-business related content consumption.
tags: []
logsource:
  definition: THIRDPARTY_THIRDPARTY
  category: THIRD_PARTY_LOG
  product: Zscaler
detection:
  mappingtable:
    category:
    - Body Art
    severity:
    - 3
    act:
    - Blocked
  condition: mappingtable
level: info
taxonomy: tm-v1
