title: Copyright Infringement Content Blocked
description: Detects and blocks access to websites or content that may contain copyrighted material being distributed without authorization. This filter helps organizations maintain compliance with intellectual property laws and prevents potential legal liability from unauthorized downloading or streaming of protected content.
tags: []
logsource:
  definition: THIRDPARTY_THIRDPARTY
  category: THIRD_PARTY_LOG
  product: Zscaler
detection:
  mappingtable:
    category:
    - 'Copyright Infringement'
    severity:
    - '3'
    act:
    - '*Blocked*'
  condition: mappingtable
level: info
taxonomy: tm-v1
