title: Developer Tools Access Blocked - Medium Risk
description: Detects blocked access attempts to developer tools and platforms that may pose security risks to organizational infrastructure. This filter identifies when users attempt to access development environments, code repositories, or programming tools that have been restricted due to potential data exfiltration risks, unauthorized code deployment, or exposure of sensitive development resources.
tags: []
logsource:
  definition: THIRDPARTY_THIRDPARTY
  category: THIRD_PARTY_LOG
  product: Zscaler
detection:
  mappingtable:
    category:
    - 'Developer Tools'
    severity:
    - '3'
    act:
    - '*Blocked*'
  condition: mappingtable
level: info
taxonomy: tm-v1
