title: Health Category Content Blocked - Medium Risk Security Filter
description: Detects when Zscaler blocks access to health-related content with medium severity risk level. This filter identifies potential attempts to access inappropriate health websites, malicious health-related domains, or policy violations related to health content that could pose security risks or violate organizational acceptable use policies. Monitoring these blocks helps maintain network security and ensures compliance with content filtering policies.
tags: []
logsource:
  definition: THIRDPARTY_THIRDPARTY
  category: THIRD_PARTY_LOG
  product: Zscaler
detection:
  mappingtable:
    category:
    - 'Health'
    severity:
    - '3'
    act:
    - '*Blocked*'
  condition: mappingtable
level: info
taxonomy: tm-v1
