title: Militancy and Hate Extremism Content Blocked
description: Detects and blocks access to websites containing militant or hate-based extremist content that promotes violence, discrimination, or radical ideologies. This filter helps prevent exposure to potentially harmful content that could radicalize users or violate organizational security policies and regulatory compliance requirements.
tags: []
logsource:
  definition: THIRDPARTY_THIRDPARTY
  category: THIRD_PARTY_LOG
  product: Zscaler
detection:
  mappingtable:
    category:
    - 'Militancy/Hate and Extremism'
    severity:
    - '3'
    act:
    - '*Blocked*'
  condition: mappingtable
level: info
taxonomy: tm-v1
