title: Online Trading and Brokerage Platform Access Blocked
description: Detects and blocks access to online trading and brokerage websites. This policy helps organizations maintain compliance with financial regulations, prevent unauthorized trading activities during work hours, and reduce potential security risks associated with financial platforms that may contain sensitive personal information or be targets for phishing attacks.
tags: []
logsource:
  definition: THIRDPARTY_THIRDPARTY
  category: THIRD_PARTY_LOG
  product: Zscaler
detection:
  mappingtable:
    category:
    - Online Trading, Brokerage
    severity:
    - 3
    act:
    - Blocked
  condition: mappingtable
level: info
taxonomy: tm-v1
