title: Questionable Content Access Blocked
description: Detects and blocks user attempts to access questionable web content that may violate organizational policies or pose security risks. This filter helps maintain compliance with acceptable use policies and prevents exposure to potentially harmful or inappropriate material that could impact productivity or create liability issues.
tags: []
logsource:
  definition: THIRDPARTY_THIRDPARTY
  category: THIRD_PARTY_LOG
  product: Zscaler
detection:
  mappingtable:
    category:
    - 'Questionable'
    severity:
    - '3'
    act:
    - '*Blocked*'
  condition: mappingtable
level: info
taxonomy: tm-v1
