title: Spyware Command and Control Communication Blocked
description: Detects and blocks outbound network connections to known spyware command and control servers. This filter identifies malicious communication attempts where compromised endpoints try to establish contact with remote threat actor infrastructure for data exfiltration, command execution, or malware updates. Blocking these connections prevents data theft and disrupts ongoing spyware operations within the network.
tags: []
logsource:
  definition: THIRDPARTY_THIRDPARTY
  category: THIRD_PARTY_LOG
  product: Zscaler
detection:
  mappingtable:
    category:
    - Spyware Callback
    severity:
    - 3
    act:
    - Blocked
  condition: mappingtable
level: info
taxonomy: tm-v1
