title: Critical Severity Download
description: Netskope Detection - detecting URL download with critical severity 
tags: []
logsource:
  category: THIRD_PARTY_LOG
  definition: THIRDPARTY_THIRDPARTY
  product: Netskope
detection:
  filter0:
    vendorParsed.severity: 'Critical'
  filter1:
    vendorParsed.action: 'block'
  filter2:
    vendorParsed.act: 'Download'
  condition: filter0 and filter1 and filter2
level: info
taxonomy: tm-v1