title: High Severity Post Alert
description: Netskope Detection - detecting URL post with high alert severity 
tags: []
logsource:
  category: THIRD_PARTY_LOG
  definition: THIRDPARTY_THIRDPARTY
  product: Netskope
detection:
  filter0:
    vendorParsed.severity: 'High'
  filter1:
    vendorParsed.action: 'alert'
  filter2:
    vendorParsed.act: 'Post'
  condition: filter0 and filter1 and filter2
level: info
taxonomy: tm-v1