title: Medium Severity Post
description: Netskope Detection for detecting URL post with medium severity 
tags: []
logsource:
  category: THIRD_PARTY_LOG
  definition: THIRDPARTY_THIRDPARTY
  product: Netskope
detection:
  filter0:
    vendorParsed.severity: 'Medium'
  filter1:
    vendorParsed.action: 'block'
  filter2:
    vendorParsed.act: 'Post'
  condition: filter0 and filter1 and filter2
level: info
taxonomy: tm-v1