title: Legacy Mode Event Log Settings Modification
description: TxOne Alert for Changes in the Settings of Event Log
tags: []
logsource:
  category: THIRD_PARTY_LOG
  definition: THIRDPARTY_THIRDPARTY
  product: TxOne Networks
detection:
  eventId:
    vendorParsed.eventId: '1103'
  condition: eventId
level: info
taxonomy: tm-v1