title: Legacy Mode Incoming Files Scanned by AV
description: TxOne warning for Incoming Files Scanned by AV. Action was taken according to settings. 
tags: []
logsource:
  category: THIRD_PARTY_LOG
  definition: THIRDPARTY_THIRDPARTY
  product: TxOne Networks
detection:
  eventId:
    vendorParsed.eventId: '8010'
  condition: eventId
level: info
taxonomy: tm-v1