title: Legacy Mode Disable DLL Injection Prevention
description: TxOne Networks Alert for DLL Injection Prevention Disabled
tags: []
logsource:
  category: THIRD_PARTY_LOG
  definition: THIRDPARTY_THIRDPARTY
  product: TXONE NETWORKS
detection:
  eventId:
    vendorParsed.eventId: '1034'
  condition: eventId
level: info
taxonomy: tm-v1