title: Legacy Mode File Execution Detected and Quarantined
description: TxOne Networks warning for File Execution Detected and Quarantined Successfully.
tags: []
logsource:
  category: THIRD_PARTY_LOG
  definition: THIRDPARTY_THIRDPARTY
  product: TXONE NETWORKS
detection:
  eventId:
    vendorParsed.eventId: '8014'
  condition: eventId
level: info
taxonomy: tm-v1