title: Legacy Mode User Password Change 
description: TxOne Networks Alert for User Password Change
tags: []
logsource:
  category: THIRD_PARTY_LOG
  definition: THIRDPARTY_THIRDPARTY
  product: TXONE NETWORKS
detection:
  eventId:
    vendorParsed.eventId: '1006'
  condition: eventId
level: info
taxonomy: tm-v1