title: Legacy Mode Disable Integrity Monitoring
description: TxOne Alert for Integrity Monitoring Disabled
tags: []
logsource:
  category: THIRD_PARTY_LOG
  definition: THIRDPARTY_THIRDPARTY
  product: TxOne Networks
detection:
  eventId:
    vendorParsed.eventId: '1077'
  condition: eventId
level: info
taxonomy: tm-v1