title: Legacy Mode Disable API Hooking Prevention
description: TxOne Alert for API Hooking Prevention Disabled
tags: []
logsource:
  category: THIRD_PARTY_LOG
  definition: THIRDPARTY_THIRDPARTY
  product: TxOne Networks
detection:
  eventId:
    vendorParsed.eventId: '1030'
  condition: eventId
level: info
taxonomy: tm-v1