title: Malicious File Execution Quarantine Fail
description: TxOne Networks Detection for failed quarantine of executed malicious file 
tags: []
logsource:
  category: THIRD_PARTY_LOG
  definition: THIRDPARTY_THIRDPARTY
  product: TXONE NETWORKS
detection:
  eventId:
    vendorParsed.eventId: '4620'
  condition: eventId
level: info
taxonomy: tm-v1