title: Real-Time Scan Disabled
description: TxOne Detection for Disabling Real-Time Scan Protection
tags: []
logsource:
  category: THIRD_PARTY_LOG
  definition: THIRDPARTY_THIRDPARTY
  product: TxOne Networks
detection:
  eventId:
    vendorParsed.eventId: '8706'
  condition: eventId
level: info
taxonomy: tm-v1