title: Brute Force Attack on Keycloak via Repeated Login Failures
description: |-
  Detects brute force credential attacks targeting Keycloak Identity and Access Management platform. The rule identifies scenarios where multiple failed authentication attempts (7 or more) are observed from the same source IP address targeting the same username within a short time window.
references: []
tags: []
logsource:
  category: THIRD_PARTY_LOG
  product: Keycloak
  definition: THIRDPARTY_THIRDPARTY
detection:
  selection:
    actResult: '*failed*'
    eventSubName: '*LOGIN*'
  condition: selection
level: info
taxonomy: tm-v1
