title: Botnet Responder Blocked
description: SonicWall Detection - Suspected Botnet responder blocked %s, Source Dynamic List
tags: []
logsource:
  definition: THIRDPARTY_THIRDPARTY
  category: THIRD_PARTY_LOG
  product: SONICWALL
detection:
  logId:
    vendorLogId: '1519'
  condition: logId
level: info
taxonomy: tm-v1
