title: Custom Botnet Initiator Blocked
description: SonicWall Detection - Suspected Botnet initiator blocked %s, Source Custom List
tags: []
logsource:
  definition: THIRDPARTY_THIRDPARTY
  category: THIRD_PARTY_LOG
  product: SONICWALL
detection:
  logId:
    vendorLogId: '1476'
  condition: logId
level: info
taxonomy: tm-v1
