title: IDP Expiration Message
description: SonicWall Detection - Intrusion Detection/Prevention service expired
tags: []
references:
  - https://www.sonicwall.com/support/technical-documentation/docs/nsm-system_events/Content/nsm-system-events.htm
logsource:
  definition: THIRDPARTY_THIRDPARTY
  category: THIRD_PARTY_LOG
  product: SONICWALL
detection:
  logId:
    vendorLogId: '614'
  condition: logId
level: info
taxonomy: tm-v1
