title: IPv6 MAC-IP Anti-Spoof Cahce Not Router
description: SonicWall Detection - IPv6 MAC-IP Anti-spoof cache found, but it is not a router
tags: []
logsource:
  definition: THIRDPARTY_THIRDPARTY
  category: THIRD_PARTY_LOG
  product: SONICWALL
detection:
  logId:
    vendorLogId: '1509'
  condition: logId
level: info
taxonomy: tm-v1
