title: ISAKMP Packet on Wrong Port
description: SonicWall Detection - ISAKMP packet received on unexpected port
tags: []
references:
  - https://www.sonicwall.com/support/technical-documentation/docs/nsm-system_events/Content/nsm-system-events.htm
logsource:
  definition: THIRDPARTY_THIRDPARTY
  category: THIRD_PARTY_LOG
  product: SONICWALL
detection:
  logId:
    vendorLogId: '607'
  condition: logId
level: info
taxonomy: tm-v1
