title: LDAP SERVER CERT WITH WRONG NAME
description: SonicWall Detection - Allowed LDAP server certificate with wrong host name
tags: []
logsource:
  definition: THIRDPARTY_THIRDPARTY
  category: THIRD_PARTY_LOG
  product: SONICWALL
detection:
  logId:
    vendorLogId: '752'
  condition: logId
level: info
taxonomy: tm-v1
