title: Next-Gen AV Agent Out of Date
description: SonicWall Detection - Endpoint Next-Gen AV agent is out of date
tags: []
references:
  - https://www.sonicwall.com/support/technical-documentation/docs/nsm-system_events/Content/nsm-system-events.htm
logsource:
  definition: THIRDPARTY_THIRDPARTY
  category: THIRD_PARTY_LOG
  product: SONICWALL
detection:
  logId:
    vendorLogId: '1560'
  condition: logId
level: info
taxonomy: tm-v1
