title: Notification on Invalid SPI
description: SonicWall Detection - Invalid SPI notification received
tags: []
references:
  - https://www.sonicwall.com/support/technical-documentation/docs/nsm-system_events/Content/nsm-system-events.htm
logsource:
  definition: THIRDPARTY_THIRDPARTY
  category: THIRD_PARTY_LOG
  product: SONICWALL
detection:
  logId:
    vendorLogId: '416'
  condition: logId
level: info
taxonomy: tm-v1
