title: Possible FIN Flood Continues
description: SonicWall Detection - Possible FIN flood attack continues
tags: []
references:
  - https://www.sonicwall.com/support/technical-documentation/docs/nsm-system_events/Content/nsm-system-events.htm
logsource:
  definition: THIRDPARTY_THIRDPARTY
  category: THIRD_PARTY_LOG
  product: SONICWALL
detection:
  logId:
    vendorLogId: '909'
  condition: logId
level: info
taxonomy: tm-v1
