title: SMTP Server Found on Reject List
description: SonicWall Detection - SMTP server found on GRID reject list
tags: []
references:
  - https://www.sonicwall.com/support/technical-documentation/docs/nsm-system_events/Content/nsm-system-events.htm
logsource:
  definition: THIRDPARTY_THIRDPARTY
  category: THIRD_PARTY_LOG
  product: SONICWALL
detection:
  logId:
    vendorLogId: '1093'
  condition: logId
level: info
taxonomy: tm-v1
