title: TCP Null Scan
description: SonicWall Detection - Probable TCP NULL scan detected
tags: []
logsource:
  definition: THIRDPARTY_THIRDPARTY
  category: THIRD_PARTY_LOG
  product: SONICWALL
detection:
  logId:
    vendorLogId: '179'
  condition: logId
level: info
taxonomy: tm-v1
