title: User Log Audit Trail Error
description: SonicWall Detection - User log audit trail error
tags: []
references:
  - https://www.sonicwall.com/support/technical-documentation/docs/nsm-system_events/Content/nsm-system-events.htm
logsource:
  definition: THIRDPARTY_THIRDPARTY
  category: THIRD_PARTY_LOG
  product: SONICWALL
detection:
  logId:
    vendorLogId: '1204'
  condition: logId
level: info
taxonomy: tm-v1
