title: User Login Lockout
description: SonicWall Detection - User account locked out after failed login attempts
tags: []
references:
  - https://www.sonicwall.com/support/technical-documentation/docs/nsm-system_events/Content/nsm-system-events.htm
logsource:
  definition: THIRDPARTY_THIRDPARTY
  category: THIRD_PARTY_LOG
  product: SONICWALL
detection:
  logId:
    vendorLogId: '329'
  condition: logId
level: info
taxonomy: tm-v1
