title: TLC-Edge Web CA Total Defense Suite UNCWS UnassignFunctionalRoles Stored Procedure SQL Injection
description: A SQL Injection vulnerability exists in CA Total Defense Suite that can be reached through the remote web service call UnAssignFunctionalUsers. The vulnerability is due to insufficient handling of the request's modifiedData parameter.
tags:
- mitre.t1190
logsource:
  definition: THIRDPARTY_THIRDPARTY
  category: THIRD_PARTY_LOG
  product: TXOne Networks
detection:
  mappingtable:
    ruleId: 1054858
  condition: selection and mappingtable
level: info
taxonomy: tm-v1
