title: TLC-Edge Web SQL Injection Attempt -23
description: SQL injection is a vulnerability that allows an attacker to alter backend SQL statements by manipulating the user input. An SQL injection occurs when web applications accept user input that is directly placed into a SQL statement and doesn't properly filter out dangerous characters.
tags:
- mitre.t1190
- mitre.t1078
logsource:
  definition: THIRDPARTY_THIRDPARTY
  category: THIRD_PARTY_LOG
  product: TXOne Networks
detection:
  mappingtable:
    ruleId: 1054870
  condition: selection and mappingtable
level: info
taxonomy: tm-v1
