title: TLC-Edge VULN Adobe Shockwave Director File Key Chunk Parsing Buffer Overflow
description: A buffer overflow vulnerability exists in Adobe Shockwave Player. The vulnerability is due to an error allocating a buffer for the Key element in a Director file.
tags:
- mitre.t1574
- mitre.t1548.001
- mitre.t1499.004
logsource:
  definition: THIRDPARTY_THIRDPARTY
  category: THIRD_PARTY_LOG
  product: TXOne Networks
detection:
  mappingtable:
    ruleId: 1054884
  condition: selection and mappingtable
level: info
taxonomy: tm-v1
