title: TLC-Edge Web Cisco Unified Communications Manager Multiple SQL Injections
description: Multiple SQL injection vulnerabilities exist within Cisco Unified Communications Manager. These vulnerabilities could be exploited by remote attackers to conduct SQL injection attacks on the server.
tags:
- mitre.t1190
logsource:
  definition: THIRDPARTY_THIRDPARTY
  category: THIRD_PARTY_LOG
  product: TXOne Networks
detection:
  mappingtable:
    ruleId: 1054898
  condition: selection and mappingtable
level: info
taxonomy: tm-v1
