title: TLC-Edge VULN Cisco Network Registrar Default Credentials Authentication Bypass
description: An authentication weakness vulnerability exists in Cisco Network Registrar. The vulnerability is due to using a default password for the administrative account.
tags:
- mitre.t1078
logsource:
  definition: THIRDPARTY_THIRDPARTY
  category: THIRD_PARTY_LOG
  product: TXOne Networks
detection:
  mappingtable:
    ruleId: 1054901
  condition: selection and mappingtable
level: info
taxonomy: tm-v1
