title: TLC-Edge FTP RMD Command Buffer Overflow
description: Buffer overflow in the FTP service in multiple products allows remote attackers to cause a denial of service (application crash) and execute arbitrary code via a long username in the RMD command.
tags:
- mitre.t1574
- mitre.t0866
logsource:
  definition: THIRDPARTY_THIRDPARTY
  category: THIRD_PARTY_LOG
  product: TXOne Networks
detection:
  mappingtable:
    ruleId: 1054452
  condition: selection and mappingtable
level: info
taxonomy: tm-v1
