title: Host Checker Compliance - Fully Non Compliant
description: SolarWinds detection for Host Checker Compliance - Fully Non Compliant. Detects when a Pulse Secure host is fully non compliant.
references: []
tags: []
logsource:
    category: THIRD_PARTY_LOG
    product: SolarWinds
    definition: THIRDPARTY_THIRDPARTY
detection:
    string_condition_0:
        eventName: '*host_checker_compliance*'
    string_condition_1:
        actResult: '*Fully Non Compliant*'
    condition: string_condition_0 and string_condition_1
level: info
taxonomy: tm-v1