title: Host Checker Failed
description: SolarWinds detection for Host Checker Failed. Detects when a Pulse Secure host checker failed.
references: []
tags: []
logsource:
    category: THIRD_PARTY_LOG
    product: SolarWinds
    definition: THIRDPARTY_THIRDPARTY
detection:
    string_condition_0:
        eventName: '*host_checker_failed*'
    condition: string_condition_0
level: info
taxonomy: tm-v1