title: Password Changed
description: SolarWinds detection for password changed. Detects when a Pulse Secure password change event is logged.
references: []
tags: []
logsource:
    category: THIRD_PARTY_LOG
    product: SolarWinds
    definition: THIRDPARTY_THIRDPARTY
detection:
    string_condition_0:
        eventName: '*password_changed*'
    condition: string_condition_0 
level: info
taxonomy: tm-v1