title: Remote Address Changed
description: SolarWinds detection for remote address changed. Detects when a Pulse Secure Host changes its remote address.
references: []
tags: []
logsource:
    category: THIRD_PARTY_LOG
    product: SolarWinds
    definition: THIRDPARTY_THIRDPARTY
detection:
    string_condition_0:
        eventName: '*remote_address_changed*'
    condition: string_condition_0 
level: info
taxonomy: tm-v1