title: User Account Locked
description: SolarWinds detection for user account locked. Detects when a  Pulse Secure user account is locked out.
references: []
tags: []
logsource:
    category: THIRD_PARTY_LOG
    product: SolarWinds
    definition: THIRDPARTY_THIRDPARTY
detection:
    string_condition_0:
        eventName: '*user_account_locked*'
    condition: string_condition_0 
level: info
taxonomy: tm-v1