title: Virus Signature Downloaded
description: SolarWinds detection for virus signature downloaded. Detects when a Pulse Secure Host downloaded a virus signature.
references: []
tags: []
logsource:
    category: THIRD_PARTY_LOG
    product: SolarWinds
    definition: THIRDPARTY_THIRDPARTY
detection:
    string_condition_0:
        eventName: '*virus_signature_downloaded*'
    condition: string_condition_0 
level: info
taxonomy: tm-v1