title: Multiple Failed Logins with Expired Password (Event 4625 - 0xC000006E)
description: |-
  Detects multiple failed Windows authentication attempts caused by expired passwords or account restrictions. This filter identifies Windows Security Event ID 4625 (failed logon) with NTSTATUS error code 0xC000006E (STATUS_ACCOUNT_RESTRICTION), which indicates the authentication failure occurred because the target account password has expired or the account is otherwise restricted.
references: []
tags: []
logsource:
  category: THIRD_PARTY_LOG
  product: Microsoft
  definition: THIRDPARTY_THIRDPARTY
detection:
  selection_eventid:
    winEventId: '4625'
  selection_errorcode:
    errorCode: '0xC000006E'
  condition: selection_eventid and selection_errorcode
level: info
taxonomy: tm-v1
