title: Legacy Mode File Execution Detected but not Quarantined
description: TxOne Networks warning for File Execution Detected and not Quarantined Successfully.
tags: []
logsource:
  category: THIRD_PARTY_LOG
  definition: THIRDPARTY_THIRDPARTY
  product: TXONE NETWORKS
detection:
  eventId:
    vendorParsed.eventId: '8015'
  condition: eventId
level: info
taxonomy: tm-v1