title: Maintenance Mode Started
description: TxOne Networks Detection for Enabling Maintenance Mode. During the Maintenance Mode, the agents allows all file executions and adds all files that are created, executed, or modified to the Approved List
tags: []
logsource:
  category: THIRD_PARTY_LOG
  definition: THIRDPARTY_THIRDPARTY
  product: TXONE NETWORKS
detection:
  eventId:
    vendorParsed.eventId: '9216'
  condition: eventId
level: info
taxonomy: tm-v1