title: Blocked Critical Severity Firewall Rules
description: Citrix Detection for Blocked Firewall rules with Critical Severity
tags: []
logsource:
  category: THIRD_PARTY_LOG
  definition: THIRDPARTY_THIRDPARTY
  product: Citrix
detection:
  filters:
    severity: '9'
    act: '*blocked*'
  condition: filters
level: info
taxonomy: tm-v1
