title: Blocked High Severity Firewall Rules
description: Citrix Detection for Blocked Firewall rules with High Severity
tags: []
logsource:
  category: THIRD_PARTY_LOG
  definition: THIRDPARTY_THIRDPARTY
  product: Citrix
detection:
  filters:
    severity: '8'
    act: 'blocked'
  condition: filters
level: info
taxonomy: tm-v1
