title: Not Blocked Medium Severity Firewall Rules
description: Citrix Detection for Not Blocked Firewall rules with Medium Severity
tags: []
logsource:
  category: THIRD_PARTY_LOG
  definition: THIRDPARTY_THIRDPARTY
  product: Citrix
detection:
  filters:
    severity: '6'
    act: 'not blocked'
  condition: filters
level: info
taxonomy: tm-v1
