title: VMware rhttpproxy Redirect Detected
description: Detects when the rhttpproxy service on a VMware ESXi host logs a Redirect action.
tags: []
logsource:
    category: THIRD_PARTY_LOG
    product: VMware
    definition: THIRDPARTY_THIRDPARTY
detection:
    parser:
        actualParserId: 'vrl.syslog.vmware.esxi.rhttpproxy'
    procName:
        processName: 'rhttpproxy'
    string_condition_0:
         act: '*Redirect*'
    condition: (parser or procName) and string_condition_0
level: info
taxonomy: tm-v1
