title: Windows Security Auditing - Brute Force Login Attempt Detected
description: Detects brute force login attempts from a single source recorded in Windows Security Auditing logs.
tags: []
logsource:
    category: THIRD_PARTY_LOG
    product: McAfee
    definition: THIRDPARTY_THIRDPARTY
detection:
    string_condition_0:
        eventName: '*Brute Force Login Attempts from a Single Source*'
    condition: string_condition_0
level: info
taxonomy: tm-v1
