title: Windows Security Auditing - Domain User Failed Logon Due To Invalid Password
description: Detects domain user failed logon due to invalid password recorded in Windows Security Auditing logs.
tags: []
logsource:
    category: THIRD_PARTY_LOG
    product: McAfee
    definition: THIRDPARTY_THIRDPARTY
detection:
    string_condition_0:
        eventName: '*Domain User Failed Logon Due To Invalid Password*'
    condition: string_condition_0
level: info
taxonomy: tm-v1