title: Windows Security Auditing - Restricted Domain Account Failed Logon
description: Detects restricted domain account failed logon recorded in Windows Security Auditing logs.
tags: []
logsource:
    category: THIRD_PARTY_LOG
    product: McAfee
    definition: THIRDPARTY_THIRDPARTY
detection:
    string_condition_0:
        eventName: '*Restricted Domain Account Failed Logon*'
    condition: string_condition_0
level: info
taxonomy: tm-v1